/* automatically generated by rust-bindgen */

#[allow(unused_imports)] use super::*;


#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct SpriteInfo {
    pub _bindgen_opaque_blob: [u32; 13usize],
}
#[test]
fn bindgen_test_layout_SpriteInfo() {
    assert_eq!(
        ::std::mem::size_of::<SpriteInfo>(),
        52usize,
        concat!("Size of: ", stringify!(SpriteInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<SpriteInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(SpriteInfo))
    );
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct Sprite {
    pub _bindgen_opaque_blob: [u32; 28usize],
}
#[test]
fn bindgen_test_layout_Sprite() {
    assert_eq!(
        ::std::mem::size_of::<Sprite>(),
        112usize,
        concat!("Size of: ", stringify!(Sprite))
    );
    assert_eq!(
        ::std::mem::align_of::<Sprite>(),
        4usize,
        concat!("Alignment of ", stringify!(Sprite))
    );
}
#[repr(C)]
#[repr(align(4))]
pub struct SpriteAnim {
    pub _bindgen_opaque_blob: [u32; 112usize],
}
#[test]
fn bindgen_test_layout_SpriteAnim() {
    assert_eq!(
        ::std::mem::size_of::<SpriteAnim>(),
        448usize,
        concat!("Size of: ", stringify!(SpriteAnim))
    );
    assert_eq!(
        ::std::mem::align_of::<SpriteAnim>(),
        4usize,
        concat!("Alignment of ", stringify!(SpriteAnim))
    );
}
