/* automatically generated by rust-bindgen */

#[allow(unused_imports)] use super::*;


pub type asBYTE = ::std::os::raw::c_uchar;
pub type asDWORD = ::std::os::raw::c_ulong;
#[repr(C)]
pub struct asIObjectType__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct asIObjectType {
    pub vtable_: *const asIObjectType__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_asIObjectType() {
    assert_eq!(
        ::std::mem::size_of::<asIObjectType>(),
        4usize,
        concat!("Size of: ", stringify!(asIObjectType))
    );
    assert_eq!(
        ::std::mem::align_of::<asIObjectType>(),
        4usize,
        concat!("Alignment of ", stringify!(asIObjectType))
    );
}
#[repr(C)]
pub struct ScriptString__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
pub struct ScriptString {
    pub vtable_: *const ScriptString__bindgen_vtable,
    pub buffer: stlp_std_string,
    pub refCount: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ScriptString() {
    assert_eq!(
        ::std::mem::size_of::<ScriptString>(),
        32usize,
        concat!("Size of: ", stringify!(ScriptString))
    );
    assert_eq!(
        ::std::mem::align_of::<ScriptString>(),
        4usize,
        concat!("Alignment of ", stringify!(ScriptString))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ScriptString>())).buffer as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ScriptString),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ScriptString>())).refCount as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ScriptString),
            "::",
            stringify!(refCount)
        )
    );
}
#[repr(C)]
pub struct ScriptArray__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct ScriptArray {
    pub vtable_: *const ScriptArray__bindgen_vtable,
    pub refCount: ::std::os::raw::c_int,
    pub gcFlag: bool,
    pub objType: *mut asIObjectType,
    pub buffer: *mut ScriptArray_ArrayBuffer,
    pub elementSize: ::std::os::raw::c_int,
    pub cmpFuncId: ::std::os::raw::c_int,
    pub eqFuncId: ::std::os::raw::c_int,
    pub subTypeId: ::std::os::raw::c_int,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScriptArray_ArrayBuffer {
    pub numElements: asDWORD,
    pub data: [asBYTE; 1usize],
}
#[test]
fn bindgen_test_layout_ScriptArray_ArrayBuffer() {
    assert_eq!(
        ::std::mem::size_of::<ScriptArray_ArrayBuffer>(),
        8usize,
        concat!("Size of: ", stringify!(ScriptArray_ArrayBuffer))
    );
    assert_eq!(
        ::std::mem::align_of::<ScriptArray_ArrayBuffer>(),
        4usize,
        concat!("Alignment of ", stringify!(ScriptArray_ArrayBuffer))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ScriptArray_ArrayBuffer>())).numElements as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ScriptArray_ArrayBuffer),
            "::",
            stringify!(numElements)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ScriptArray_ArrayBuffer>())).data as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ScriptArray_ArrayBuffer),
            "::",
            stringify!(data)
        )
    );
}
#[test]
fn bindgen_test_layout_ScriptArray() {
    assert_eq!(
        ::std::mem::size_of::<ScriptArray>(),
        36usize,
        concat!("Size of: ", stringify!(ScriptArray))
    );
    assert_eq!(
        ::std::mem::align_of::<ScriptArray>(),
        4usize,
        concat!("Alignment of ", stringify!(ScriptArray))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ScriptArray>())).refCount as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ScriptArray),
            "::",
            stringify!(refCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ScriptArray>())).gcFlag as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ScriptArray),
            "::",
            stringify!(gcFlag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ScriptArray>())).objType as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ScriptArray),
            "::",
            stringify!(objType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ScriptArray>())).buffer as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ScriptArray),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ScriptArray>())).elementSize as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ScriptArray),
            "::",
            stringify!(elementSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ScriptArray>())).cmpFuncId as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ScriptArray),
            "::",
            stringify!(cmpFuncId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ScriptArray>())).eqFuncId as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ScriptArray),
            "::",
            stringify!(eqFuncId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ScriptArray>())).subTypeId as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ScriptArray),
            "::",
            stringify!(subTypeId)
        )
    );
}
