/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    storage: Storage,
    align: [Align; 0],
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn new(storage: Storage) -> Self {
        Self { storage, align: [] }
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {

pub const PASS_HASH_SIZE: u32 = 32;
pub const MAX_STORED_IP: u32 = 20;
pub const MAX_HEX_OFFSET: u32 = 50;
pub const MAX_CRIT_TYPES: u32 = 1000;
pub const EFFECT_TEXTURES: u32 = 10;
pub const EFFECT_SCRIPT_VALUES: u32 = 10;
pub const CRITTER_USER_DATA_SIZE: u32 = 400;
pub const VAR_GLOBAL: u32 = 0;
pub const VAR_LOCAL: u32 = 1;
pub const VAR_UNICUM: u32 = 2;
pub const VAR_LOCAL_LOCATION: u32 = 3;
pub const VAR_LOCAL_MAP: u32 = 4;
pub const VAR_LOCAL_ITEM: u32 = 5;
pub const VAR_FLAG_QUEST: u32 = 1;
pub const VAR_FLAG_RANDOM: u32 = 2;
pub const VAR_FLAG_NO_CHECK: u32 = 4;
pub const PROTO_ITEM_USER_DATA_SIZE: u32 = 500;
pub const ITEM_MAX_BLOCK_LINES: u32 = 50;
pub const ITEM_MAX_CHILDS: u32 = 5;
pub const ITEM_MAX_CHILD_LINES: u32 = 6;
pub const ITEM_MAX_SCRIPT_VALUES: u32 = 10;
pub const USE_NONE: u32 = 15;
pub const MAX_PARAMS: u32 = 1000;
pub const TB_BATTLE_TIMEOUT: u32 = 100000000;
pub const MAP_LOOP_FUNC_MAX: u32 = 5;
pub const MAP_MAX_DATA: u32 = 100;
pub const SPRITE_CUT_HORIZONTAL: u32 = 1;
pub const SPRITE_CUT_VERTICAL: u32 = 2;
pub const CHANGE_LANG_CTRL_SHIFT: u32 = 0;
pub const CHANGE_LANG_ALT_SHIFT: u32 = 1;
pub const INDICATOR_LINES: u32 = 0;
pub const INDICATOR_NUMBERS: u32 = 1;
pub const INDICATOR_BOTH: u32 = 2;
pub const MIN_ZOOM: f64 = 0.2;
pub const MAX_ZOOM: f64 = 10.0;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __uint64_t = ::std::os::raw::c_ulonglong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_longlong;
pub type __u_quad_t = ::std::os::raw::c_ulonglong;
pub type __intmax_t = ::std::os::raw::c_longlong;
pub type __uintmax_t = ::std::os::raw::c_ulonglong;
pub type __dev_t = __u_quad_t;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = __u_quad_t;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_uint;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = __quad_t;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = __u_quad_t;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = __quad_t;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = __u_quad_t;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = __u_quad_t;
pub type __fsword_t = ::std::os::raw::c_int;
pub type __ssize_t = ::std::os::raw::c_int;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_int;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___true_type {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___true_type() {
    assert_eq!(
        ::std::mem::size_of::<std___true_type>(),
        1usize,
        concat!("Size of: ", stringify!(std___true_type))
    );
    assert_eq!(
        ::std::mem::align_of::<std___true_type>(),
        1usize,
        concat!("Alignment of ", stringify!(std___true_type))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___false_type {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___false_type() {
    assert_eq!(
        ::std::mem::size_of::<std___false_type>(),
        1usize,
        concat!("Size of: ", stringify!(std___false_type))
    );
    assert_eq!(
        ::std::mem::align_of::<std___false_type>(),
        1usize,
        concat!("Alignment of ", stringify!(std___false_type))
    );
}
pub type std___truth_type___type = std___false_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___traitor {
    pub _address: u8,
}
pub const std___traitor___value: std___traitor__bindgen_ty_1 = 0;
pub type std___traitor__bindgen_ty_1 = i32;
pub type std___traitor___type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___are_same {
    pub _address: u8,
}
pub const std___are_same___value: std___are_same__bindgen_ty_1 = 0;
pub type std___are_same__bindgen_ty_1 = i32;
pub type std___are_same___type = std___false_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_void {
    pub _address: u8,
}
pub const std___is_void___value: std___is_void__bindgen_ty_1 = 0;
pub type std___is_void__bindgen_ty_1 = i32;
pub type std___is_void___type = std___false_type;
#[test]
fn __bindgen_test_layout_std___is_void_open0_void_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_void>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_void)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_void>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_void)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_integer {
    pub _address: u8,
}
pub const std___is_integer___value: std___is_integer__bindgen_ty_1 = 0;
pub type std___is_integer__bindgen_ty_1 = i32;
pub type std___is_integer___type = std___false_type;
#[test]
fn __bindgen_test_layout_std___is_integer_open0_bool__close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_integer_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_integer_open0_signed_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_integer_open0_unsigned_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_integer_open0_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_integer_open0_short_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_integer_open0_unsigned_short_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_integer_open0_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_integer_open0_unsigned_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_integer_open0_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_integer_open0_unsigned_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_integer_open0_long_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_integer_open0_unsigned_long_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_floating {
    pub _address: u8,
}
pub const std___is_floating___value: std___is_floating__bindgen_ty_1 = 0;
pub type std___is_floating__bindgen_ty_1 = i32;
pub type std___is_floating___type = std___false_type;
#[test]
fn __bindgen_test_layout_std___is_floating_open0_float_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_floating>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_floating)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_floating>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_floating)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_floating_open0_double_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_floating>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_floating)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_floating>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_floating)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_floating_open0_long_double_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_floating>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_floating)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_floating>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_floating)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_pointer {
    pub _address: u8,
}
pub const std___is_pointer___value: std___is_pointer__bindgen_ty_1 = 0;
pub type std___is_pointer__bindgen_ty_1 = i32;
pub type std___is_pointer___type = std___false_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_arithmetic {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_scalar {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_char {
    pub _address: u8,
}
pub const std___is_char___value: std___is_char__bindgen_ty_1 = 0;
pub type std___is_char__bindgen_ty_1 = i32;
pub type std___is_char___type = std___false_type;
#[test]
fn __bindgen_test_layout_std___is_char_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_char>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_char)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_char>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_char)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_char_open0_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_char>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_char)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_char>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_char)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_byte {
    pub _address: u8,
}
pub const std___is_byte___value: std___is_byte__bindgen_ty_1 = 0;
pub type std___is_byte__bindgen_ty_1 = i32;
pub type std___is_byte___type = std___false_type;
#[test]
fn __bindgen_test_layout_std___is_byte_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_byte>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_byte)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_byte>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_byte)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_byte_open0_signed_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_byte>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_byte)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_byte>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_byte)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_byte_open0_unsigned_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_byte>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_byte)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_byte>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_byte)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_move_iterator {
    pub _address: u8,
}
pub const std___is_move_iterator___value: std___is_move_iterator__bindgen_ty_1 = 0;
pub type std___is_move_iterator__bindgen_ty_1 = i32;
pub type std___is_move_iterator___type = std___false_type;
#[repr(C)]
pub struct std_exception__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std_exception {
    pub vtable_: *const std_exception__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_std_exception() {
    assert_eq!(
        ::std::mem::size_of::<std_exception>(),
        4usize,
        concat!("Size of: ", stringify!(std_exception))
    );
    assert_eq!(
        ::std::mem::align_of::<std_exception>(),
        4usize,
        concat!("Alignment of ", stringify!(std_exception))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt9exceptionD1Ev"]
    pub fn std_exception_exception_destructor(this: *mut std_exception);
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt9exception4whatEv"]
    pub fn std_exception_what(this: *mut ::std::os::raw::c_void) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_exception {
    pub _base: std_exception,
}
#[test]
fn bindgen_test_layout_std_bad_exception() {
    assert_eq!(
        ::std::mem::size_of::<std_bad_exception>(),
        4usize,
        concat!("Size of: ", stringify!(std_bad_exception))
    );
    assert_eq!(
        ::std::mem::align_of::<std_bad_exception>(),
        4usize,
        concat!("Alignment of ", stringify!(std_bad_exception))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt13bad_exceptionD1Ev"]
    pub fn std_bad_exception_bad_exception_destructor(this: *mut std_bad_exception);
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt13bad_exception4whatEv"]
    pub fn std_bad_exception_what(
        this: *mut ::std::os::raw::c_void,
    ) -> *const ::std::os::raw::c_char;
}
pub type std_terminate_handler = ::std::option::Option<unsafe extern "C" fn()>;
pub type std_unexpected_handler = ::std::option::Option<unsafe extern "C" fn()>;
extern "C" {
    #[link_name = "\u{1}_ZSt13set_terminatePFvvE"]
    pub fn std_set_terminate(arg1: std_terminate_handler) -> std_terminate_handler;
}
extern "C" {
    #[link_name = "\u{1}_ZSt9terminatev"]
    pub fn std_terminate();
}
extern "C" {
    #[link_name = "\u{1}_ZSt14set_unexpectedPFvvE"]
    pub fn std_set_unexpected(arg1: std_unexpected_handler) -> std_unexpected_handler;
}
extern "C" {
    #[link_name = "\u{1}_ZSt10unexpectedv"]
    pub fn std_unexpected();
}
extern "C" {
    #[link_name = "\u{1}_ZSt18uncaught_exceptionv"]
    pub fn std_uncaught_exception() -> bool;
}
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_alloc {
    pub _base: std_exception,
}
#[test]
fn bindgen_test_layout_std_bad_alloc() {
    assert_eq!(
        ::std::mem::size_of::<std_bad_alloc>(),
        4usize,
        concat!("Size of: ", stringify!(std_bad_alloc))
    );
    assert_eq!(
        ::std::mem::align_of::<std_bad_alloc>(),
        4usize,
        concat!("Alignment of ", stringify!(std_bad_alloc))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt9bad_allocD1Ev"]
    pub fn std_bad_alloc_bad_alloc_destructor(this: *mut std_bad_alloc);
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt9bad_alloc4whatEv"]
    pub fn std_bad_alloc_what(this: *mut ::std::os::raw::c_void) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_nothrow_t {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_nothrow_t() {
    assert_eq!(
        ::std::mem::size_of::<std_nothrow_t>(),
        1usize,
        concat!("Size of: ", stringify!(std_nothrow_t))
    );
    assert_eq!(
        ::std::mem::align_of::<std_nothrow_t>(),
        1usize,
        concat!("Alignment of ", stringify!(std_nothrow_t))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZSt7nothrow"]
    pub static std_nothrow: std_nothrow_t;
}
pub type std_new_handler = ::std::option::Option<unsafe extern "C" fn()>;
extern "C" {
    #[link_name = "\u{1}_ZSt15set_new_handlerPFvvE"]
    pub fn std_set_new_handler(arg1: std_new_handler) -> std_new_handler;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std___true_type {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_stlp_std___true_type() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___true_type>(),
        1usize,
        concat!("Size of: ", stringify!(stlp_std___true_type))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___true_type>(),
        1usize,
        concat!("Alignment of ", stringify!(stlp_std___true_type))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std___false_type {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_stlp_std___false_type() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___false_type>(),
        1usize,
        concat!("Size of: ", stringify!(stlp_std___false_type))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___false_type>(),
        1usize,
        concat!("Alignment of ", stringify!(stlp_std___false_type))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__MoveSourceTraits {
    pub _address: u8,
}
pub type stlp_std_priv__MoveSourceTraits__MvImpRet = stlp_std___move_traits;
pub const stlp_std_priv__MoveSourceTraits__MvImp: stlp_std_priv___MoveSourceTraits__bindgen_ty_1 =
    0;
pub type stlp_std_priv__MoveSourceTraits__bindgen_ty_1 = i32;
pub type stlp_std_priv__MoveSourceTraits__Type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv___move_traits_aux {
    pub _address: u8,
}
pub type stlp_std_priv___move_traits_aux_implemented = stlp_std___move_traits;
pub type stlp_std_priv___move_traits_aux_complete = stlp_std___move_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv___move_traits_aux2 {
    pub _address: u8,
}
pub type stlp_std_priv___move_traits_aux2__MoveTraits1 = stlp_std___move_traits;
pub type stlp_std_priv___move_traits_aux2__MoveTraits2 = stlp_std___move_traits;
pub type stlp_std_priv___move_traits_aux2_implemented = stlp_std__Lor2;
pub type stlp_std_priv___move_traits_aux2_complete = stlp_std__Land2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv___move_traits_help {
    pub _address: u8,
}
pub type stlp_std_priv___move_traits_help_implemented = stlp_std___true_type;
pub type stlp_std_priv___move_traits_help_complete = stlp_std___move_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv___move_traits_help1 {
    pub _address: u8,
}
pub type stlp_std_priv___move_traits_help1__MoveTraits1 = stlp_std___move_traits;
pub type stlp_std_priv___move_traits_help1__MoveTraits2 = stlp_std___move_traits;
pub type stlp_std_priv___move_traits_help1_implemented = stlp_std__Lor2;
pub type stlp_std_priv___move_traits_help1_complete = stlp_std__Land2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv___move_traits_help2 {
    pub _address: u8,
}
pub type stlp_std_priv___move_traits_help2__MoveTraits1 = stlp_std___move_traits;
pub type stlp_std_priv___move_traits_help2__MoveTraits2 = stlp_std___move_traits;
pub type stlp_std_priv___move_traits_help2_implemented = stlp_std___true_type;
pub type stlp_std_priv___move_traits_help2_complete = stlp_std__Land2;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_priv__Select1st {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_priv__Select2nd {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_priv__Project1st {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_priv__Project2nd {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_priv__Identity {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__Constant_unary_fun<_Result> {
    pub _M_val: stlp_std_priv___Constant_unary_fun_result_type<_Result>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Result>>,
}
pub type stlp_std_priv__Constant_unary_fun_argument_type<_Argument> = _Argument;
pub type stlp_std_priv__Constant_unary_fun_result_type<_Result> = _Result;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__Constant_binary_fun<_Result> {
    pub _M_val: _Result,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Result>>,
}
pub type stlp_std_priv__Constant_binary_fun_first_argument_type<_Arg1> = _Arg1;
pub type stlp_std_priv__Constant_binary_fun_second_argument_type<_Arg2> = _Arg2;
pub type stlp_std_priv__Constant_binary_fun_result_type<_Result> = _Result;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__IsCharLikeType {
    pub _address: u8,
}
pub type stlp_std_priv__IsCharLikeType__Ret = stlp_std___false_type;
#[test]
fn __bindgen_test_layout_stlp_std_priv__IsCharLikeType_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_priv___IsCharLikeType>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_priv___IsCharLikeType)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_priv___IsCharLikeType>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_priv___IsCharLikeType)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_priv__IsCharLikeType_open0_unsigned_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_priv___IsCharLikeType>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_priv___IsCharLikeType)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_priv___IsCharLikeType>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_priv___IsCharLikeType)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_priv__IsCharLikeType_open0_signed_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_priv___IsCharLikeType>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_priv___IsCharLikeType)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_priv___IsCharLikeType>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_priv___IsCharLikeType)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv___alloc_type_traits {
    pub _address: u8,
}
pub type stlp_std_priv___alloc_type_traits__STLportAlloc = stlp_std__IsSTLportClass;
pub type stlp_std_priv___alloc_type_traits_has_trivial_default_constructor =
    stlp_std_priv____alloc_type_traits__STLportAlloc;
pub type stlp_std_priv___alloc_type_traits_has_trivial_copy_constructor =
    stlp_std_priv____alloc_type_traits__STLportAlloc;
pub type stlp_std_priv___alloc_type_traits_has_trivial_assignment_operator =
    stlp_std_priv____alloc_type_traits__STLportAlloc;
pub type stlp_std_priv___alloc_type_traits_has_trivial_destructor =
    stlp_std_priv____alloc_type_traits__STLportAlloc;
pub type stlp_std_priv___alloc_type_traits_is_POD_type =
    stlp_std_priv____alloc_type_traits__STLportAlloc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__STLP_alloc_proxy<_Value, _MaybeReboundAlloc> {
    pub _base: _MaybeReboundAlloc,
    pub _M_data: _Value,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Value>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_MaybeReboundAlloc>>,
}
pub type stlp_std_priv__STLP_alloc_proxy__Base<_MaybeReboundAlloc> = _MaybeReboundAlloc;
pub type stlp_std_priv__STLP_alloc_proxy_size_type = [u8; 0usize];
pub type stlp_std_priv__STLP_alloc_proxy__Self<_Value, _MaybeReboundAlloc> =
    stlp_std_priv___STLP_alloc_proxy<_Value, _MaybeReboundAlloc>;
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv14__get_c_stringERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"]
    pub fn stlp_std_priv___get_c_string(
        __str: *const stlp_std_string,
    ) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
pub struct stlp_std_priv__String_base<_Tp, _Alloc> {
    pub _M_buffers: stlp_std_priv___String_base__Buffers<_Tp>,
    pub _M_finish: *mut _Tp,
    pub _M_start_of_storage: stlp_std_priv___String_base__AllocProxy<_Tp, _Alloc>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Alloc>>,
}
pub type stlp_std_priv__String_base__Self<_Tp, _Alloc> = stlp_std_priv___String_base<_Tp, _Alloc>;
pub const stlp_std_priv__String_base__DEFAULT_SIZE: stlp_std_priv___String_base__bindgen_ty_1 = 0;
pub type stlp_std_priv__String_base__bindgen_ty_1 = i32;
pub type stlp_std_priv__String_base_allocator_type<_Alloc> = _Alloc;
pub type stlp_std_priv__String_base__AllocProxy<_Tp, _Alloc> =
    stlp_std_priv___STLP_alloc_proxy<_Tp, stlp_std_priv___String_base_allocator_type<_Alloc>>;
pub type stlp_std_priv__String_base_size_type = usize;
#[repr(C)]
pub union stlp_std_priv__String_base__Buffers<_Tp> {
    pub _M_end_of_storage: *mut _Tp,
    pub _M_static_buf: *mut _Tp,
    _bindgen_union_align: u32,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__String_reserve_t {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_stlp_std_priv__String_reserve_t() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_priv__String_reserve_t>(),
        1usize,
        concat!("Size of: ", stringify!(stlp_std_priv__String_reserve_t))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_priv__String_reserve_t>(),
        1usize,
        concat!("Alignment of ", stringify!(stlp_std_priv__String_reserve_t))
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_priv__Eq_traits {
    pub _address: u8,
}
#[repr(C)]
pub struct stlp_std_priv__Eq_char_bound {
    pub __val: [u8; 0usize],
}
#[repr(C)]
pub struct stlp_std_priv__Neq_char_bound {
    pub __val: [u8; 0usize],
}
#[repr(C)]
pub struct stlp_std_priv__Eq_int_bound {
    pub __val: [u8; 0usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__Constant_void_fun<_Result> {
    pub _M_val: stlp_std_priv___Constant_void_fun_result_type<_Result>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Result>>,
}
pub type stlp_std_priv__Constant_void_fun_result_type<_Result> = _Result;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_priv__Not_within_traits {
    pub _M_first: *const stlp_std_priv___Not_within_traits__CharT,
    pub _M_last: *const stlp_std_priv___Not_within_traits__CharT,
}
pub type stlp_std_priv__Not_within_traits__CharT = [u8; 0usize];
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv11_GetFacetIdEPKNS_9money_getIcNS_19istreambuf_iteratorIcNS_11char_traitsIcEEEEEE"]
    pub fn stlp_std_priv__GetFacetId(arg1: *const stlp_std_money_get) -> *mut stlp_std_locale_id;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv11_GetFacetIdEPKNS_9money_putIcNS_19ostreambuf_iteratorIcNS_11char_traitsIcEEEEEE"]
    pub fn stlp_std_priv__GetFacetId1(arg1: *const stlp_std_money_put) -> *mut stlp_std_locale_id;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv11_GetFacetIdEPKNS_7num_getIcNS_19istreambuf_iteratorIcNS_11char_traitsIcEEEEEE"]
    pub fn stlp_std_priv__GetFacetId2(arg1: *const stlp_std_num_get) -> *mut stlp_std_locale_id;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv11_GetFacetIdEPKNS_7num_putIcNS_19ostreambuf_iteratorIcNS_11char_traitsIcEEEEEE"]
    pub fn stlp_std_priv__GetFacetId3(arg1: *const stlp_std_num_put) -> *mut stlp_std_locale_id;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv11_GetFacetIdEPKNS_8time_getIcNS_19istreambuf_iteratorIcNS_11char_traitsIcEEEEEE"]
    pub fn stlp_std_priv__GetFacetId4(arg1: *const stlp_std_time_get) -> *mut stlp_std_locale_id;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv11_GetFacetIdEPKNS_8time_putIcNS_19ostreambuf_iteratorIcNS_11char_traitsIcEEEEEE"]
    pub fn stlp_std_priv__GetFacetId5(arg1: *const stlp_std_time_put) -> *mut stlp_std_locale_id;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv11_GetFacetIdEPKNS_9money_getIwNS_19istreambuf_iteratorIwNS_11char_traitsIwEEEEEE"]
    pub fn stlp_std_priv__GetFacetId6(arg1: *const stlp_std_money_get) -> *mut stlp_std_locale_id;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv11_GetFacetIdEPKNS_9money_putIwNS_19ostreambuf_iteratorIwNS_11char_traitsIwEEEEEE"]
    pub fn stlp_std_priv__GetFacetId7(arg1: *const stlp_std_money_put) -> *mut stlp_std_locale_id;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv11_GetFacetIdEPKNS_7num_getIwNS_19istreambuf_iteratorIwNS_11char_traitsIwEEEEEE"]
    pub fn stlp_std_priv__GetFacetId8(arg1: *const stlp_std_num_get) -> *mut stlp_std_locale_id;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv11_GetFacetIdEPKNS_7num_putIwNS_19ostreambuf_iteratorIwNS_11char_traitsIwEEEEEE"]
    pub fn stlp_std_priv__GetFacetId9(arg1: *const stlp_std_num_put) -> *mut stlp_std_locale_id;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv11_GetFacetIdEPKNS_8time_getIwNS_19istreambuf_iteratorIwNS_11char_traitsIwEEEEEE"]
    pub fn stlp_std_priv__GetFacetId10(arg1: *const stlp_std_time_get) -> *mut stlp_std_locale_id;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv11_GetFacetIdEPKNS_8time_putIwNS_19ostreambuf_iteratorIwNS_11char_traitsIwEEEEEE"]
    pub fn stlp_std_priv__GetFacetId11(arg1: *const stlp_std_time_put) -> *mut stlp_std_locale_id;
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_priv___iostring_allocator<_CharT> {
    pub _M_static_buf: *mut _CharT,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
pub const stlp_std_priv___iostring_allocator__STR_SIZE:
    stlp_std_priv____iostring_allocator__bindgen_ty_1 = 0;
pub type stlp_std_priv___iostring_allocator__bindgen_ty_1 = i32;
pub const stlp_std_priv___iostring_allocator__BUF_SIZE:
    stlp_std_priv____iostring_allocator__bindgen_ty_2 = 0;
pub type stlp_std_priv___iostring_allocator__bindgen_ty_2 = i32;
pub type stlp_std_priv___iostring_allocator__Base = stlp_std_allocator;
pub type stlp_std_priv___iostring_allocator_size_type = stlp_std_priv____iostring_allocator__Base;
pub type stlp_std_priv___iostring_allocator_pointer = stlp_std_priv____iostring_allocator__Base;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv___iostring_allocator_rebind {
    pub _address: u8,
}
pub type stlp_std_priv___iostring_allocator_rebind_other<_Tp1> =
    stlp_std_priv____iostring_allocator<_Tp1>;
#[repr(C)]
pub struct stlp_std_priv___basic_iostring<_CharT> {
    pub _base: stlp_std_basic_string<_CharT, stlp_std_priv____iostring_allocator<_CharT>>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
pub type stlp_std_priv___basic_iostring__Self<_CharT> = stlp_std_priv____basic_iostring<_CharT>;
pub type stlp_std_priv___basic_iostring__Base<_CharT> =
    stlp_std_basic_string<_CharT, stlp_std_priv____iostring_allocator<_CharT>>;
pub type stlp_std_priv___basic_iostring__Reserve_t<_CharT> =
    stlp_std_priv____basic_iostring__Base<_CharT>;
pub type stlp_std_priv___iostring = stlp_std_priv____basic_iostring<::std::os::raw::c_char>;
pub type stlp_std_priv___iowstring = stlp_std_priv____basic_iostring<u32>;
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv13__write_floatERNS0_16__basic_iostringIcEEiid"]
    pub fn stlp_std_priv___write_float(
        arg1: *mut stlp_std_priv____iostring,
        arg2: stlp_std_ios_base_fmtflags,
        arg3: ::std::os::raw::c_int,
        arg4: f64,
    ) -> usize;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv13__write_floatERNS0_16__basic_iostringIcEEiie"]
    pub fn stlp_std_priv___write_float1(
        arg1: *mut stlp_std_priv____iostring,
        arg2: stlp_std_ios_base_fmtflags,
        arg3: ::std::os::raw::c_int,
        arg4: f64,
    ) -> usize;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv18__get_floor_digitsERNS0_16__basic_iostringIcEEe"]
    pub fn stlp_std_priv___get_floor_digits(arg1: *mut stlp_std_priv____iostring, arg2: f64);
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv22__convert_float_bufferERKNS0_16__basic_iostringIcEERNS1_IwEERKNS_5ctypeIwEEwb"]
    pub fn stlp_std_priv___convert_float_buffer(
        arg1: *const stlp_std_priv____iostring,
        arg2: *mut stlp_std_priv____iowstring,
        arg3: *const stlp_std_ctype,
        arg4: u32,
        arg5: bool,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv21__adjust_float_bufferERNS0_16__basic_iostringIcEEc"]
    pub fn stlp_std_priv___adjust_float_buffer(
        arg1: *mut stlp_std_priv____iostring,
        arg2: ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv15__write_integerEPcil"]
    pub fn stlp_std_priv___write_integer(
        buf: *mut ::std::os::raw::c_char,
        flags: stlp_std_ios_base_fmtflags,
        x: ::std::os::raw::c_long,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv17__insert_groupingEPcS1_RKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEccci"]
    pub fn stlp_std_priv___insert_grouping(
        first: *mut ::std::os::raw::c_char,
        last: *mut ::std::os::raw::c_char,
        arg1: *const stlp_std_string,
        arg2: ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_char,
        arg4: ::std::os::raw::c_char,
        arg5: ::std::os::raw::c_int,
    ) -> isize;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv17__insert_groupingERNS0_16__basic_iostringIcEEjRKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEccci"]
    pub fn stlp_std_priv___insert_grouping1(
        arg1: *mut stlp_std_priv____iostring,
        arg2: usize,
        arg3: *const stlp_std_string,
        arg4: ::std::os::raw::c_char,
        arg5: ::std::os::raw::c_char,
        arg6: ::std::os::raw::c_char,
        arg7: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv17__insert_groupingEPwS1_RKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEwwwi"]
    pub fn stlp_std_priv___insert_grouping2(
        arg1: *mut u32,
        arg2: *mut u32,
        arg3: *const stlp_std_string,
        arg4: u32,
        arg5: u32,
        arg6: u32,
        arg7: ::std::os::raw::c_int,
    ) -> isize;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv17__insert_groupingERNS0_16__basic_iostringIwEEjRKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEEwwwi"]
    pub fn stlp_std_priv___insert_grouping3(
        arg1: *mut stlp_std_priv____iowstring,
        arg2: usize,
        arg3: *const stlp_std_string,
        arg4: u32,
        arg5: u32,
        arg6: u32,
        arg7: ::std::os::raw::c_int,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__Numeric_limits_base {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__LimG {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}is_specialized"]
    pub static stlp_std_priv_is_specialized: bool;
}
extern "C" {
    #[link_name = "\u{1}digits"]
    pub static stlp_std_priv_digits: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}digits10"]
    pub static stlp_std_priv_digits10: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}is_signed"]
    pub static stlp_std_priv_is_signed: bool;
}
extern "C" {
    #[link_name = "\u{1}is_integer"]
    pub static stlp_std_priv_is_integer: bool;
}
extern "C" {
    #[link_name = "\u{1}is_exact"]
    pub static stlp_std_priv_is_exact: bool;
}
extern "C" {
    #[link_name = "\u{1}radix"]
    pub static stlp_std_priv_radix: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}min_exponent"]
    pub static stlp_std_priv_min_exponent: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}max_exponent"]
    pub static stlp_std_priv_max_exponent: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}min_exponent10"]
    pub static stlp_std_priv_min_exponent10: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}max_exponent10"]
    pub static stlp_std_priv_max_exponent10: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}has_infinity"]
    pub static stlp_std_priv_has_infinity: bool;
}
extern "C" {
    #[link_name = "\u{1}has_quiet_NaN"]
    pub static stlp_std_priv_has_quiet_NaN: bool;
}
extern "C" {
    #[link_name = "\u{1}has_signaling_NaN"]
    pub static stlp_std_priv_has_signaling_NaN: bool;
}
extern "C" {
    #[link_name = "\u{1}has_denorm"]
    pub static stlp_std_priv_has_denorm: stlp_std_float_denorm_style;
}
extern "C" {
    #[link_name = "\u{1}has_denorm_loss"]
    pub static stlp_std_priv_has_denorm_loss: bool;
}
extern "C" {
    #[link_name = "\u{1}is_iec559"]
    pub static stlp_std_priv_is_iec559: bool;
}
extern "C" {
    #[link_name = "\u{1}is_bounded"]
    pub static stlp_std_priv_is_bounded: bool;
}
extern "C" {
    #[link_name = "\u{1}is_modulo"]
    pub static stlp_std_priv_is_modulo: bool;
}
extern "C" {
    #[link_name = "\u{1}traps"]
    pub static stlp_std_priv_traps: bool;
}
extern "C" {
    #[link_name = "\u{1}tinyness_before"]
    pub static stlp_std_priv_tinyness_before: bool;
}
extern "C" {
    #[link_name = "\u{1}round_style"]
    pub static stlp_std_priv_round_style: stlp_std_float_round_style;
}
#[repr(C)]
pub union stlp_std_priv_float_helper__WordsNumber<_Number> {
    pub _Words: [::std::os::raw::c_ushort; 8usize],
    pub _num: _Number,
    _bindgen_union_align: [u16; 8usize],
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Number>>,
}
#[repr(C)]
pub union stlp_std_priv_float_helper2__WordsNumber<_Number> {
    pub _Words: [::std::os::raw::c_ushort; 8usize],
    pub _num: _Number,
    _bindgen_union_align: [u16; 8usize],
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Number>>,
}
pub type stlp_std_priv___max_int_t = ::std::os::raw::c_long;
pub type stlp_std_priv___umax_int_t = ::std::os::raw::c_ulong;
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv19__hex_char_table_loEv"]
    pub fn stlp_std_priv___hex_char_table_lo() -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv19__hex_char_table_hiEv"]
    pub fn stlp_std_priv___hex_char_table_hi() -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv16__valid_groupingEPKcS2_S2_S2_"]
    pub fn stlp_std_priv___valid_grouping(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
        arg4: *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv12__get_fdigitERwPKw"]
    pub fn stlp_std_priv___get_fdigit(arg1: *mut u32, arg2: *const u32) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv19__get_fdigit_or_sepERwwPKw"]
    pub fn stlp_std_priv___get_fdigit_or_sep(arg1: *mut u32, arg2: u32, arg3: *const u32) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv21_Initialize_get_floatERKNS_5ctypeIwEERwS5_S5_S5_Pw"]
    pub fn stlp_std_priv__Initialize_get_float(
        arg1: *const stlp_std_ctype,
        arg2: *mut u32,
        arg3: *mut u32,
        arg4: *mut u32,
        arg5: *mut u32,
        arg6: *mut u32,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv17__string_to_floatERKNS0_16__basic_iostringIcEERf"]
    pub fn stlp_std_priv___string_to_float(arg1: *const stlp_std_priv____iostring, arg2: *mut f32);
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv17__string_to_floatERKNS0_16__basic_iostringIcEERd"]
    pub fn stlp_std_priv___string_to_float1(arg1: *const stlp_std_priv____iostring, arg2: *mut f64);
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv17__string_to_floatERKNS0_16__basic_iostringIcEERe"]
    pub fn stlp_std_priv___string_to_float2(arg1: *const stlp_std_priv____iostring, arg2: *mut f64);
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv17__digit_val_tableEj"]
    pub fn stlp_std_priv___digit_val_table(arg1: ::std::os::raw::c_uint)
        -> ::std::os::raw::c_uchar;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std4priv14__narrow_atomsEv"]
    pub fn stlp_std_priv___narrow_atoms() -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__Is_not_wspace {
    pub _M_ctype: *const [u8; 0usize],
}
pub type stlp_std_priv__Is_not_wspace_argument_type = [u8; 0usize];
pub type stlp_std_priv__Is_not_wspace_result_type = bool;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__Is_wspace_null {
    pub _M_ctype: *const [u8; 0usize],
}
pub type stlp_std_priv__Is_wspace_null_argument_type = [u8; 0usize];
pub type stlp_std_priv__Is_wspace_null_result_type = bool;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__Scan_for_wspace {
    pub _M_ctype: *const [u8; 0usize],
}
pub type stlp_std_priv__Scan_for_wspace_char_type = [u8; 0usize];
pub type stlp_std_priv__Scan_for_wspace_first_argument_type =
    *mut stlp_std_priv___Scan_for_wspace_char_type;
pub type stlp_std_priv__Scan_for_wspace_second_argument_type =
    *mut stlp_std_priv___Scan_for_wspace_char_type;
pub type stlp_std_priv__Scan_for_wspace_result_type =
    *mut stlp_std_priv___Scan_for_wspace_char_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__Scan_wspace_null {
    pub _M_ctype: *const [u8; 0usize],
}
pub type stlp_std_priv__Scan_wspace_null_char_type = [u8; 0usize];
pub type stlp_std_priv__Scan_wspace_null_first_argument_type =
    *mut stlp_std_priv___Scan_wspace_null_char_type;
pub type stlp_std_priv__Scan_wspace_null_second_argument_type =
    *mut stlp_std_priv___Scan_wspace_null_char_type;
pub type stlp_std_priv__Scan_wspace_null_result_type =
    *mut stlp_std_priv___Scan_wspace_null_char_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__Scan_for_not_wspace {
    pub _M_ctype: *const [u8; 0usize],
}
pub type stlp_std_priv__Scan_for_not_wspace_char_type = [u8; 0usize];
pub type stlp_std_priv__Scan_for_not_wspace_first_argument_type =
    *mut stlp_std_priv___Scan_for_not_wspace_char_type;
pub type stlp_std_priv__Scan_for_not_wspace_second_argument_type =
    *mut stlp_std_priv___Scan_for_not_wspace_char_type;
pub type stlp_std_priv__Scan_for_not_wspace_result_type =
    *mut stlp_std_priv___Scan_for_not_wspace_char_type;
#[repr(C)]
pub struct stlp_std_priv__Scan_for_char_val {
    pub _M_val: stlp_std_priv___Scan_for_char_val_char_type,
}
pub type stlp_std_priv__Scan_for_char_val_char_type = [u8; 0usize];
pub type stlp_std_priv__Scan_for_char_val_first_argument_type =
    *mut stlp_std_priv___Scan_for_char_val_char_type;
pub type stlp_std_priv__Scan_for_char_val_second_argument_type =
    *mut stlp_std_priv___Scan_for_char_val_char_type;
pub type stlp_std_priv__Scan_for_char_val_result_type =
    *mut stlp_std_priv___Scan_for_char_val_char_type;
#[repr(C)]
pub struct stlp_std_priv__Scan_for_int_val {
    pub _M_val: stlp_std_priv___Scan_for_int_val_int_type,
}
pub type stlp_std_priv__Scan_for_int_val_char_type = [u8; 0usize];
pub type stlp_std_priv__Scan_for_int_val_int_type = [u8; 0usize];
pub type stlp_std_priv__Scan_for_int_val_first_argument_type =
    *mut stlp_std_priv___Scan_for_int_val_char_type;
pub type stlp_std_priv__Scan_for_int_val_second_argument_type =
    *mut stlp_std_priv___Scan_for_int_val_char_type;
pub type stlp_std_priv__Scan_for_int_val_result_type =
    *mut stlp_std_priv___Scan_for_int_val_char_type;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_priv__Vector_base<_Tp, _Alloc> {
    pub _M_start: stlp_std_priv___Vector_base_pointer<_Tp>,
    pub _M_finish: stlp_std_priv___Vector_base_pointer<_Tp>,
    pub _M_end_of_storage: stlp_std_priv___Vector_base__AllocProxy<_Tp, _Alloc>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Alloc>>,
}
pub type stlp_std_priv__Vector_base__Self<_Tp, _Alloc> = stlp_std_priv___Vector_base<_Tp, _Alloc>;
pub type stlp_std_priv__Vector_base_allocator_type<_Alloc> = _Alloc;
pub type stlp_std_priv__Vector_base_pointer<_Tp> = *mut _Tp;
pub type stlp_std_priv__Vector_base__AllocProxy<_Tp, _Alloc> = stlp_std_priv___STLP_alloc_proxy<
    stlp_std_priv___Vector_base_pointer<_Tp>,
    stlp_std_priv___Vector_base_allocator_type<_Alloc>,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__Bit_reference {
    pub _M_p: *mut ::std::os::raw::c_uint,
    pub _M_mask: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_stlp_std_priv__Bit_reference() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_priv__Bit_reference>(),
        8usize,
        concat!("Size of: ", stringify!(stlp_std_priv__Bit_reference))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_priv__Bit_reference>(),
        4usize,
        concat!("Alignment of ", stringify!(stlp_std_priv__Bit_reference))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<stlp_std_priv__Bit_reference>()))._M_p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_priv__Bit_reference),
            "::",
            stringify!(_M_p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<stlp_std_priv__Bit_reference>()))._M_mask as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_priv__Bit_reference),
            "::",
            stringify!(_M_mask)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__Bit_iterator_base {
    pub _M_p: *mut ::std::os::raw::c_uint,
    pub _M_offset: ::std::os::raw::c_uint,
}
pub type stlp_std_priv__Bit_iterator_base_difference_type = isize;
#[test]
fn bindgen_test_layout_stlp_std_priv__Bit_iterator_base() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_priv__Bit_iterator_base>(),
        8usize,
        concat!("Size of: ", stringify!(stlp_std_priv__Bit_iterator_base))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_priv__Bit_iterator_base>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(stlp_std_priv__Bit_iterator_base)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<stlp_std_priv__Bit_iterator_base>()))._M_p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_priv__Bit_iterator_base),
            "::",
            stringify!(_M_p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<stlp_std_priv__Bit_iterator_base>()))._M_offset as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_priv__Bit_iterator_base),
            "::",
            stringify!(_M_offset)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__Bit_iter {
    pub _base: stlp_std_priv___Bit_iterator_base,
}
pub type stlp_std_priv__Bit_iter_reference<_Ref> = _Ref;
pub type stlp_std_priv__Bit_iter_pointer<_Ptr> = _Ptr;
pub type stlp_std_priv__Bit_iter__Self = stlp_std_priv___Bit_iter;
pub type stlp_std_priv__Bit_iter_iterator_category = stlp_std_random_access_iterator_tag;
pub type stlp_std_priv__Bit_iter_value_type = bool;
pub type stlp_std_priv__Bit_iter_difference_type = isize;
pub type stlp_std_priv__Bit_iter_size_type = usize;
pub type stlp_std_priv__Bit_const_iterator = stlp_std_priv___Bit_iter;
pub type stlp_std_priv__Bit_iterator = stlp_std_priv___Bit_iter;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_priv__Bvector_base {
    pub _M_start: stlp_std_priv___Bit_iterator,
    pub _M_finish: stlp_std_priv___Bit_iterator,
    pub _M_end_of_storage: stlp_std_priv___STLP_alloc_proxy<
        stlp_std_priv___Bvector_base___chunk_type,
        stlp_std_priv___Bvector_base___chunk_allocator_type,
    >,
}
pub type stlp_std_priv__Bvector_base__Self = stlp_std_priv___Bvector_base;
pub type stlp_std_priv__Bvector_base_allocator_type<_Alloc> = _Alloc;
pub type stlp_std_priv__Bvector_base___chunk_type = ::std::os::raw::c_uint;
pub type stlp_std_priv__Bvector_base___chunk_allocator_type = stlp_std__Alloc_traits;
pub type stlp_std_priv__Rb_tree_Color_type = bool;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__Rb_tree_node_base {
    pub _M_color: stlp_std_priv___Rb_tree_node_base__Color_type,
    pub _M_parent: stlp_std_priv___Rb_tree_node_base__Base_ptr,
    pub _M_left: stlp_std_priv___Rb_tree_node_base__Base_ptr,
    pub _M_right: stlp_std_priv___Rb_tree_node_base__Base_ptr,
}
pub type stlp_std_priv__Rb_tree_node_base__Color_type = stlp_std_priv___Rb_tree_Color_type;
pub type stlp_std_priv__Rb_tree_node_base__Base_ptr = *mut stlp_std_priv___Rb_tree_node_base;
#[test]
fn bindgen_test_layout_stlp_std_priv__Rb_tree_node_base() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_priv__Rb_tree_node_base>(),
        16usize,
        concat!("Size of: ", stringify!(stlp_std_priv__Rb_tree_node_base))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_priv__Rb_tree_node_base>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(stlp_std_priv__Rb_tree_node_base)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<stlp_std_priv__Rb_tree_node_base>()))._M_color as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_priv__Rb_tree_node_base),
            "::",
            stringify!(_M_color)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<stlp_std_priv__Rb_tree_node_base>()))._M_parent as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_priv__Rb_tree_node_base),
            "::",
            stringify!(_M_parent)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<stlp_std_priv__Rb_tree_node_base>()))._M_left as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_priv__Rb_tree_node_base),
            "::",
            stringify!(_M_left)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<stlp_std_priv__Rb_tree_node_base>()))._M_right as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_priv__Rb_tree_node_base),
            "::",
            stringify!(_M_right)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__Rb_tree_node<_Value> {
    pub _base: stlp_std_priv___Rb_tree_node_base,
    pub _M_value_field: _Value,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Value>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__Rb_global {
    pub _address: u8,
}
pub type stlp_std_priv__Rb_global__Base_ptr = *mut stlp_std_priv___Rb_tree_node_base;
pub type stlp_std_priv__Rb_global_inst = stlp_std_priv___Rb_global;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__Rb_tree_base_iterator {
    pub _M_node: stlp_std_priv___Rb_tree_base_iterator__Base_ptr,
}
pub type stlp_std_priv__Rb_tree_base_iterator__Base_ptr = *mut stlp_std_priv___Rb_tree_node_base;
pub type stlp_std_priv__Rb_tree_base_iterator_iterator_category =
    stlp_std_bidirectional_iterator_tag;
pub type stlp_std_priv__Rb_tree_base_iterator_difference_type = isize;
#[test]
fn bindgen_test_layout_stlp_std_priv__Rb_tree_base_iterator() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_priv__Rb_tree_base_iterator>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(stlp_std_priv__Rb_tree_base_iterator)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_priv__Rb_tree_base_iterator>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(stlp_std_priv__Rb_tree_base_iterator)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<stlp_std_priv__Rb_tree_base_iterator>()))._M_node as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_priv__Rb_tree_base_iterator),
            "::",
            stringify!(_M_node)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__Rb_tree_iterator {
    pub _base: stlp_std_priv___Rb_tree_base_iterator,
}
pub type stlp_std_priv__Rb_tree_iterator_value_type<_Value> = _Value;
pub type stlp_std_priv__Rb_tree_iterator_reference = [u8; 0usize];
pub type stlp_std_priv__Rb_tree_iterator_pointer = [u8; 0usize];
pub type stlp_std_priv__Rb_tree_iterator__Self = stlp_std_priv___Rb_tree_iterator;
pub type stlp_std_priv__Rb_tree_iterator__Base_ptr = *mut stlp_std_priv___Rb_tree_node_base;
pub type stlp_std_priv__Rb_tree_iterator__Link_type<_Value> =
    *mut stlp_std_priv___Rb_tree_node<_Value>;
pub type stlp_std_priv__Rb_tree_iterator__NonConstTraits = [u8; 0usize];
pub type stlp_std_priv__Rb_tree_iterator_iterator = [u8; 0usize];
pub type stlp_std_priv__Rb_tree_iterator__ConstTraits = [u8; 0usize];
pub type stlp_std_priv__Rb_tree_iterator_const_iterator = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__Rb_tree_base {
    pub _M_header: stlp_std_priv___Rb_tree_base__AllocProxy,
}
pub type stlp_std_priv__Rb_tree_base__Node_base = stlp_std_priv___Rb_tree_node_base;
pub type stlp_std_priv__Rb_tree_base__Node<_Tp> = stlp_std_priv___Rb_tree_node<_Tp>;
pub type stlp_std_priv__Rb_tree_base_allocator_type<_Alloc> = _Alloc;
pub type stlp_std_priv__Rb_tree_base__Self = stlp_std_priv___Rb_tree_base;
pub type stlp_std_priv__Rb_tree_base__M_node_allocator_type = stlp_std__Alloc_traits;
pub type stlp_std_priv__Rb_tree_base__AllocProxy = stlp_std_priv___STLP_alloc_proxy<
    stlp_std_priv___Rb_tree_base__Node_base,
    stlp_std_priv___Rb_tree_base__M_node_allocator_type,
>;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_priv__Rb_tree<_Compare> {
    pub _base: stlp_std_priv___Rb_tree_base,
    pub _M_node_count: stlp_std_priv___Rb_tree_size_type,
    pub _M_key_compare: _Compare,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Compare>>,
}
pub type stlp_std_priv__Rb_tree__Base = stlp_std_priv___Rb_tree_base;
pub type stlp_std_priv__Rb_tree__Self<_Compare> = stlp_std_priv___Rb_tree<_Compare>;
pub type stlp_std_priv__Rb_tree__Base_ptr = *mut stlp_std_priv___Rb_tree_node_base;
pub type stlp_std_priv__Rb_tree__Node<_Value> = stlp_std_priv___Rb_tree_node<_Value>;
pub type stlp_std_priv__Rb_tree__Link_type<_Value> = *mut stlp_std_priv___Rb_tree__Node<_Value>;
pub type stlp_std_priv__Rb_tree__Color_type = stlp_std_priv___Rb_tree_Color_type;
pub type stlp_std_priv__Rb_tree_key_type<_Key> = _Key;
pub type stlp_std_priv__Rb_tree_value_type<_Value> = _Value;
pub type stlp_std_priv__Rb_tree_pointer = [u8; 0usize];
pub type stlp_std_priv__Rb_tree_const_pointer<_Value> =
    *const stlp_std_priv___Rb_tree_value_type<_Value>;
pub type stlp_std_priv__Rb_tree_reference = [u8; 0usize];
pub type stlp_std_priv__Rb_tree_const_reference<_Value> =
    *const stlp_std_priv___Rb_tree_value_type<_Value>;
pub type stlp_std_priv__Rb_tree_size_type = usize;
pub type stlp_std_priv__Rb_tree_difference_type = isize;
pub type stlp_std_priv__Rb_tree__Iterator_category = stlp_std_bidirectional_iterator_tag;
pub type stlp_std_priv__Rb_tree_allocator_type = stlp_std_priv___Rb_tree__Base;
pub type stlp_std_priv__Rb_tree__NonConstTraits = [u8; 0usize];
pub type stlp_std_priv__Rb_tree__ConstTraits = [u8; 0usize];
pub type stlp_std_priv__Rb_tree_const_iterator = stlp_std_priv___Rb_tree_iterator;
pub type stlp_std_priv__Rb_tree_const_reverse_iterator =
    stlp_std_reverse_iterator<stlp_std_priv___Rb_tree_const_iterator>;
pub type stlp_std_priv__Rb_tree_reverse_iterator =
    stlp_std_reverse_iterator<stlp_std_priv___Rb_tree_iterator>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__ConstSetTraitsT {
    pub _address: u8,
}
pub type stlp_std_priv__ConstSetTraitsT__ConstTraits = stlp_std_priv___ConstSetTraitsT;
pub type stlp_std_priv__ConstSetTraitsT__NonConstTraits = stlp_std_priv___SetTraitsT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__SetTraitsT {
    pub _address: u8,
}
pub type stlp_std_priv__SetTraitsT__ConstTraits = stlp_std_priv___ConstSetTraitsT;
pub type stlp_std_priv__SetTraitsT__NonConstTraits = stlp_std_priv___SetTraitsT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__ConstMultisetTraitsT {
    pub _address: u8,
}
pub type stlp_std_priv__ConstMultisetTraitsT__ConstTraits = stlp_std_priv___ConstMultisetTraitsT;
pub type stlp_std_priv__ConstMultisetTraitsT__NonConstTraits = stlp_std_priv___MultisetTraitsT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__MultisetTraitsT {
    pub _address: u8,
}
pub type stlp_std_priv__MultisetTraitsT__ConstTraits = stlp_std_priv___ConstMultisetTraitsT;
pub type stlp_std_priv__MultisetTraitsT__NonConstTraits = stlp_std_priv___MultisetTraitsT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__ConstMapTraitsT {
    pub _address: u8,
}
pub type stlp_std_priv__ConstMapTraitsT__ConstTraits = stlp_std_priv___ConstMapTraitsT;
pub type stlp_std_priv__ConstMapTraitsT__NonConstTraits = stlp_std_priv___MapTraitsT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__MapTraitsT {
    pub _address: u8,
}
pub type stlp_std_priv__MapTraitsT__ConstTraits = stlp_std_priv___ConstMapTraitsT;
pub type stlp_std_priv__MapTraitsT__NonConstTraits = stlp_std_priv___MapTraitsT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__ConstMultimapTraitsT {
    pub _address: u8,
}
pub type stlp_std_priv__ConstMultimapTraitsT__ConstTraits = stlp_std_priv___ConstMultimapTraitsT;
pub type stlp_std_priv__ConstMultimapTraitsT__NonConstTraits = stlp_std_priv___MultimapTraitsT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_priv__MultimapTraitsT {
    pub _address: u8,
}
pub type stlp_std_priv__MultimapTraitsT__ConstTraits = stlp_std_priv___ConstMultimapTraitsT;
pub type stlp_std_priv__MultimapTraitsT__NonConstTraits = stlp_std_priv___MultimapTraitsT;
pub type stlp_std___bool2type__Ret = stlp_std___true_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std___type2bool {
    pub _address: u8,
}
pub const stlp_std___type2bool__Ret: stlp_std___type2bool__bindgen_ty_1 = 0;
pub type stlp_std___type2bool__bindgen_ty_1 = i32;
#[test]
fn __bindgen_test_layout_stlp_std___type2bool_open0_stlp_std___true_type_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type2bool>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type2bool)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type2bool>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type2bool)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type2bool_open0_stlp_std___false_type_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type2bool>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type2bool)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type2bool>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type2bool)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__Not {
    pub _address: u8,
}
pub type stlp_std__Not__Ret = stlp_std___false_type;
#[test]
fn __bindgen_test_layout_stlp_std__Not_open0_stlp_std___false_type_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std__Not>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std__Not)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std__Not>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std__Not)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__Land2 {
    pub _address: u8,
}
pub type stlp_std__Land2__Ret = stlp_std___false_type;
#[test]
fn __bindgen_test_layout_stlp_std__Land2_open0_stlp_std___true_type_stlp_std___true_type_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<stlp_std__Land2>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std__Land2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std__Land2>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std__Land2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__Land3 {
    pub _address: u8,
}
pub type stlp_std__Land3__Ret = stlp_std___false_type;
#[test]
fn __bindgen_test_layout_stlp_std__Land3_open0_stlp_std___true_type_stlp_std___true_type_stlp_std___true_type_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<stlp_std__Land3>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std__Land3)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std__Land3>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std__Land3)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__Lor2 {
    pub _address: u8,
}
pub type stlp_std__Lor2__Ret = stlp_std___true_type;
#[test]
fn __bindgen_test_layout_stlp_std__Lor2_open0_stlp_std___false_type_stlp_std___false_type_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<stlp_std__Lor2>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std__Lor2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std__Lor2>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std__Lor2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__Lor3 {
    pub _address: u8,
}
pub type stlp_std__Lor3__Ret = stlp_std___true_type;
#[test]
fn __bindgen_test_layout_stlp_std__Lor3_open0_stlp_std___false_type_stlp_std___false_type_stlp_std___false_type_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<stlp_std__Lor3>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std__Lor3)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std__Lor3>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std__Lor3)
        )
    );
}
pub type stlp_std___select__Ret<_Tp1> = _Tp1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__NoVolatilePointerShim {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_stlp_std__NoVolatilePointerShim() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std__NoVolatilePointerShim>(),
        1usize,
        concat!("Size of: ", stringify!(stlp_std__NoVolatilePointerShim))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std__NoVolatilePointerShim>(),
        1usize,
        concat!("Alignment of ", stringify!(stlp_std__NoVolatilePointerShim))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std22_NoVolatilePointerShimC1EPKv"]
    pub fn stlp_std__NoVolatilePointerShim__NoVolatilePointerShim(
        this: *mut stlp_std__NoVolatilePointerShim,
        arg1: *const ::std::os::raw::c_void,
    );
}
impl stlp_std__NoVolatilePointerShim {
    #[inline]
    pub unsafe fn new(arg1: *const ::std::os::raw::c_void) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        stlp_std__NoVolatilePointerShim__NoVolatilePointerShim(&mut __bindgen_tmp, arg1);
        __bindgen_tmp
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std14_IsCopyableFunEbz"]
    pub fn stlp_std__IsCopyableFun(arg1: bool, ...) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__Copyable {
    pub _address: u8,
}
pub const stlp_std__Copyable__Ret: stlp_std__Copyable__bindgen_ty_1 = 0;
pub type stlp_std__Copyable__bindgen_ty_1 = i32;
pub type stlp_std__Copyable__RetT = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__AreCopyable {
    pub _address: u8,
}
pub const stlp_std__AreCopyable__Same: stlp_std__AreCopyable__bindgen_ty_1 = 0;
pub type stlp_std__AreCopyable__bindgen_ty_1 = i32;
pub type stlp_std__AreCopyable__Ret = stlp_std__Copyable;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__AreSameTypes {
    pub _address: u8,
}
pub const stlp_std__AreSameTypes__Same: stlp_std__AreSameTypes__bindgen_ty_1 = 0;
pub type stlp_std__AreSameTypes__bindgen_ty_1 = i32;
pub type stlp_std__AreSameTypes__Ret = stlp_std___false_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__ConversionHelper {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__IsConvertible {
    pub _address: u8,
}
pub type stlp_std__IsConvertible__H = stlp_std__ConversionHelper;
pub const stlp_std__IsConvertible_value: stlp_std__IsConvertible__bindgen_ty_1 = 0;
pub type stlp_std__IsConvertible__bindgen_ty_1 = i32;
pub type stlp_std__IsConvertible__Ret = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__IsCVConvertible {
    pub _address: u8,
}
pub type stlp_std__IsCVConvertible__H = stlp_std__ConversionHelper;
pub const stlp_std__IsCVConvertible_value: stlp_std__IsCVConvertible__bindgen_ty_1 = 0;
pub type stlp_std__IsCVConvertible__bindgen_ty_1 = i32;
pub type stlp_std__IsCVConvertible__Ret = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__IsIntegral {
    pub _address: u8,
}
pub type stlp_std__IsIntegral__Ret = stlp_std___false_type;
#[test]
fn __bindgen_test_layout_stlp_std__IsIntegral_open0_bool__close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std__IsIntegral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std__IsIntegral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std__IsIntegral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std__IsIntegral)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std__IsIntegral_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std__IsIntegral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std__IsIntegral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std__IsIntegral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std__IsIntegral)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std__IsIntegral_open0_signed_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std__IsIntegral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std__IsIntegral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std__IsIntegral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std__IsIntegral)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std__IsIntegral_open0_unsigned_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std__IsIntegral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std__IsIntegral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std__IsIntegral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std__IsIntegral)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std__IsIntegral_open0_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std__IsIntegral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std__IsIntegral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std__IsIntegral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std__IsIntegral)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std__IsIntegral_open0_short_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std__IsIntegral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std__IsIntegral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std__IsIntegral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std__IsIntegral)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std__IsIntegral_open0_unsigned_short_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std__IsIntegral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std__IsIntegral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std__IsIntegral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std__IsIntegral)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std__IsIntegral_open0_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std__IsIntegral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std__IsIntegral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std__IsIntegral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std__IsIntegral)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std__IsIntegral_open0_unsigned_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std__IsIntegral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std__IsIntegral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std__IsIntegral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std__IsIntegral)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std__IsIntegral_open0_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std__IsIntegral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std__IsIntegral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std__IsIntegral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std__IsIntegral)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std__IsIntegral_open0_unsigned_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std__IsIntegral>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std__IsIntegral)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std__IsIntegral>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std__IsIntegral)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__IsRational {
    pub _address: u8,
}
pub type stlp_std__IsRational__Ret = stlp_std___false_type;
#[test]
fn __bindgen_test_layout_stlp_std__IsRational_open0_float_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std__IsRational>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std__IsRational)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std__IsRational>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std__IsRational)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std__IsRational_open0_double_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std__IsRational>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std__IsRational)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std__IsRational>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std__IsRational)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std__IsRational_open0_long_double_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std__IsRational>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std__IsRational)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std__IsRational>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std__IsRational)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std___type_traits_aux {
    pub _address: u8,
}
pub type stlp_std___type_traits_aux_has_trivial_default_constructor = stlp_std___false_type;
pub type stlp_std___type_traits_aux_has_trivial_copy_constructor = stlp_std___false_type;
pub type stlp_std___type_traits_aux_has_trivial_assignment_operator = stlp_std___false_type;
pub type stlp_std___type_traits_aux_has_trivial_destructor = stlp_std___false_type;
pub type stlp_std___type_traits_aux_is_POD_type = stlp_std___false_type;
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_aux_open0_stlp_std___false_type_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits_aux>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits_aux)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits_aux>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits_aux)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_aux_open0_stlp_std___true_type_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits_aux>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits_aux)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits_aux>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits_aux)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__IsRef {
    pub _address: u8,
}
pub type stlp_std__IsRef__Ret = stlp_std___false_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__IsPtr {
    pub _address: u8,
}
pub type stlp_std__IsPtr__Ret = stlp_std___false_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std___type_traits {
    pub _address: u8,
}
pub type stlp_std___type_traits_this_dummy_member_must_be_first = stlp_std___true_type;
pub type stlp_std___type_traits_has_trivial_default_constructor = stlp_std___false_type;
pub type stlp_std___type_traits_has_trivial_copy_constructor = stlp_std___false_type;
pub type stlp_std___type_traits_has_trivial_assignment_operator = stlp_std___false_type;
pub type stlp_std___type_traits_has_trivial_destructor = stlp_std___false_type;
pub type stlp_std___type_traits_is_POD_type = stlp_std___false_type;
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_bool__close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_bool_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_volatile_bool_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_volatile_bool_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_volatile_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_volatile_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_signed_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_signed_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_volatile_signed_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_volatile_signed_char_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_unsigned_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_unsigned_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_volatile_unsigned_char_close0_instantiation()
{
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_volatile_unsigned_char_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_volatile_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_volatile_wchar_t_close0_instantiation()
{
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_short_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_short_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_volatile_short_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_volatile_short_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_unsigned_short_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_unsigned_short_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_volatile_unsigned_short_close0_instantiation()
{
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_volatile_unsigned_short_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_volatile_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_volatile_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_unsigned_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_unsigned_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_volatile_unsigned_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_volatile_unsigned_int_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_volatile_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_volatile_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_unsigned_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_unsigned_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_volatile_unsigned_long_close0_instantiation()
{
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_volatile_unsigned_long_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_float_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_float_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_volatile_float_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_volatile_float_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_double_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_double_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_volatile_double_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_volatile_double_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_long_double_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_long_double_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_volatile_long_double_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_const_volatile_long_double_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__IsCVConvertibleIf {
    pub _address: u8,
}
pub type stlp_std__IsCVConvertibleIf__Ret = stlp_std__IsCVConvertible;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__TrivialNativeTypeCopy {
    pub _address: u8,
}
pub type stlp_std__TrivialNativeTypeCopy__Ptr1 = stlp_std__IsPtr;
pub type stlp_std__TrivialNativeTypeCopy__Ptr2 = stlp_std__IsPtr;
pub type stlp_std__TrivialNativeTypeCopy__BothPtrs = stlp_std__Land2;
pub type stlp_std__TrivialNativeTypeCopy__Convertible = stlp_std__IsCVConvertibleIf;
pub type stlp_std__TrivialNativeTypeCopy__Trivial1 = stlp_std__Land2;
pub type stlp_std__TrivialNativeTypeCopy__SameSize = u8;
pub type stlp_std__TrivialNativeTypeCopy__Int1 = stlp_std__IsIntegral;
pub type stlp_std__TrivialNativeTypeCopy__Int2 = stlp_std__IsIntegral;
pub type stlp_std__TrivialNativeTypeCopy__BothInts = stlp_std__Land2;
pub type stlp_std__TrivialNativeTypeCopy__Rat1 = stlp_std__IsRational;
pub type stlp_std__TrivialNativeTypeCopy__Rat2 = stlp_std__IsRational;
pub type stlp_std__TrivialNativeTypeCopy__BothRats = stlp_std__Land2;
pub type stlp_std__TrivialNativeTypeCopy__BothNatives = stlp_std__Lor2;
pub type stlp_std__TrivialNativeTypeCopy__Trivial2 = stlp_std__Land2;
pub type stlp_std__TrivialNativeTypeCopy__Ret = stlp_std__Lor2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__TrivialCopy {
    pub _address: u8,
}
pub type stlp_std__TrivialCopy__NativeRet = stlp_std__TrivialNativeTypeCopy;
pub type stlp_std__TrivialCopy__Tr1 = stlp_std___type_traits;
pub type stlp_std__TrivialCopy__Tr2 = stlp_std__AreCopyable;
pub type stlp_std__TrivialCopy__UserRet = stlp_std__Land2;
pub type stlp_std__TrivialCopy__Ret = stlp_std__Lor2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__TrivialUCopy {
    pub _address: u8,
}
pub type stlp_std__TrivialUCopy__NativeRet = stlp_std__TrivialNativeTypeCopy;
pub type stlp_std__TrivialUCopy__Tr1 = stlp_std___type_traits;
pub type stlp_std__TrivialUCopy__Tr2 = stlp_std__AreCopyable;
pub type stlp_std__TrivialUCopy__UserRet = stlp_std__Land2;
pub type stlp_std__TrivialUCopy__Ret = stlp_std__Lor2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__DefaultZeroValue {
    pub _address: u8,
}
pub type stlp_std__DefaultZeroValue__Tr1 = stlp_std__IsIntegral;
pub type stlp_std__DefaultZeroValue__Tr2 = stlp_std__IsRational;
pub type stlp_std__DefaultZeroValue__Tr3 = stlp_std__IsPtr;
pub type stlp_std__DefaultZeroValue__Ret = stlp_std__Lor3;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__TrivialInit {
    pub _address: u8,
}
pub type stlp_std__TrivialInit__Tr1 = stlp_std___type_traits;
pub type stlp_std__TrivialInit__Tr2 = stlp_std__DefaultZeroValue;
pub type stlp_std__TrivialInit__Tr3 = stlp_std__Not;
pub type stlp_std__TrivialInit__Ret = stlp_std__Land2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__IsPtrType {
    pub _address: u8,
}
pub type stlp_std__IsPtrType__Type = stlp_std__IsPtr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__IsRefType {
    pub _address: u8,
}
pub type stlp_std__IsRefType__Type = stlp_std__IsRef;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std___call_traits {
    pub _address: u8,
}
pub type stlp_std___call_traits_const_param_type<_Tp> = *const _Tp;
pub type stlp_std___call_traits_param_type<_Tp> = *mut _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__BothPtrType {
    pub _address: u8,
}
pub type stlp_std__BothPtrType__IsPtr1 = stlp_std__IsPtr;
pub type stlp_std__BothPtrType__IsPtr2 = stlp_std__IsPtr;
pub type stlp_std__BothPtrType__Ret = stlp_std__Land2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__OKToSwap {
    pub _address: u8,
}
pub type stlp_std__OKToSwap__Same = stlp_std__AreSameTypes;
pub type stlp_std__OKToSwap__Type = stlp_std__Land3;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__NegativeAnswer {
    pub _address: u8,
}
pub type stlp_std__NegativeAnswer__Ret = stlp_std___false_type;
#[test]
fn bindgen_test_layout_stlp_std__NegativeAnswer() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std__NegativeAnswer>(),
        1usize,
        concat!("Size of: ", stringify!(stlp_std__NegativeAnswer))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std__NegativeAnswer>(),
        1usize,
        concat!("Alignment of ", stringify!(stlp_std__NegativeAnswer))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__IsPOD {
    pub _address: u8,
}
pub type stlp_std__IsPOD__Type = stlp_std___type_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__DefaultZeroValueQuestion {
    pub _address: u8,
}
pub type stlp_std__DefaultZeroValueQuestion__Ret = stlp_std__DefaultZeroValue;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std___stlport_class {
    pub _address: u8,
}
pub type stlp_std___stlport_class__Type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__IsSTLportClass {
    pub _address: u8,
}
pub type stlp_std__IsSTLportClass__Ret = stlp_std__IsConvertible;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__TpWithState<_Tp> {
    pub _base: _Tp,
    pub _state: ::std::os::raw::c_int,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__IsStateless {
    pub _address: u8,
}
pub const stlp_std__IsStateless__Is: stlp_std__IsStateless__bindgen_ty_1 = 0;
pub type stlp_std__IsStateless__bindgen_ty_1 = i32;
pub type stlp_std__IsStateless__Ret = u8;
#[doc = "Partial move:"]
#[doc = "The source HAS to be a valid instance after the move!"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std___move_source<_Tp> {
    pub _M_data: *mut _Tp,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
}
pub type stlp_std___move_source__Self<_Tp> = stlp_std___move_source<_Tp>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std___move_traits {
    pub _address: u8,
}
pub type stlp_std___move_traits_implemented = stlp_std___false_type;
pub type stlp_std___move_traits_complete = stlp_std___type_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_pair<_T1, _T2> {
    pub first: _T1,
    pub second: _T2,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_T1>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_T2>>,
}
pub type stlp_std_pair_first_type<_T1> = _T1;
pub type stlp_std_pair_second_type<_T2> = _T2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_input_iterator_tag {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_stlp_std_input_iterator_tag() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_input_iterator_tag>(),
        1usize,
        concat!("Size of: ", stringify!(stlp_std_input_iterator_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_input_iterator_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(stlp_std_input_iterator_tag))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_output_iterator_tag {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_stlp_std_output_iterator_tag() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_output_iterator_tag>(),
        1usize,
        concat!("Size of: ", stringify!(stlp_std_output_iterator_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_output_iterator_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(stlp_std_output_iterator_tag))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_forward_iterator_tag {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_stlp_std_forward_iterator_tag() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_forward_iterator_tag>(),
        1usize,
        concat!("Size of: ", stringify!(stlp_std_forward_iterator_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_forward_iterator_tag>(),
        1usize,
        concat!("Alignment of ", stringify!(stlp_std_forward_iterator_tag))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_bidirectional_iterator_tag {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_stlp_std_bidirectional_iterator_tag() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_bidirectional_iterator_tag>(),
        1usize,
        concat!("Size of: ", stringify!(stlp_std_bidirectional_iterator_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_bidirectional_iterator_tag>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(stlp_std_bidirectional_iterator_tag)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_random_access_iterator_tag {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_stlp_std_random_access_iterator_tag() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_random_access_iterator_tag>(),
        1usize,
        concat!("Size of: ", stringify!(stlp_std_random_access_iterator_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_random_access_iterator_tag>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(stlp_std_random_access_iterator_tag)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_iterator {
    pub _address: u8,
}
pub type stlp_std_iterator_iterator_category<_Category> = _Category;
pub type stlp_std_iterator_value_type<_Tp> = _Tp;
pub type stlp_std_iterator_difference_type<_Distance> = _Distance;
pub type stlp_std_iterator_pointer<_Pointer> = _Pointer;
pub type stlp_std_iterator_reference<_Reference> = _Reference;
#[test]
fn __bindgen_test_layout_stlp_std_iterator_open0_stlp_std_output_iterator_tag_void_void_void_void_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_iterator>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_iterator)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_iterator>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_iterator)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_iterator_traits {
    pub _address: u8,
}
pub type stlp_std_iterator_traits_iterator_category = [u8; 0usize];
pub type stlp_std_iterator_traits_value_type = [u8; 0usize];
pub type stlp_std_iterator_traits_difference_type = [u8; 0usize];
pub type stlp_std_iterator_traits_pointer = [u8; 0usize];
pub type stlp_std_iterator_traits_reference = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_input_iterator {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_output_iterator {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_stlp_std_output_iterator() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_output_iterator>(),
        1usize,
        concat!("Size of: ", stringify!(stlp_std_output_iterator))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_output_iterator>(),
        1usize,
        concat!("Alignment of ", stringify!(stlp_std_output_iterator))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_forward_iterator {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_bidirectional_iterator {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_random_access_iterator {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__Const_traits {
    pub _address: u8,
}
pub type stlp_std__Const_traits_value_type<_Tp> = _Tp;
pub type stlp_std__Const_traits_reference<_Tp> = *const _Tp;
pub type stlp_std__Const_traits_pointer<_Tp> = *const _Tp;
pub type stlp_std__Const_traits__ConstTraits = stlp_std__Const_traits;
pub type stlp_std__Const_traits__NonConstTraits = stlp_std__Nonconst_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__Nonconst_traits {
    pub _address: u8,
}
pub type stlp_std__Nonconst_traits_value_type<_Tp> = _Tp;
pub type stlp_std__Nonconst_traits_reference<_Tp> = *mut _Tp;
pub type stlp_std__Nonconst_traits_pointer<_Tp> = *mut _Tp;
pub type stlp_std__Nonconst_traits__ConstTraits = stlp_std__Const_traits;
pub type stlp_std__Nonconst_traits__NonConstTraits = stlp_std__Nonconst_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__Const_Const_traits {
    pub _address: u8,
}
pub type stlp_std__Const_Const_traits_value_type<_Tp> = _Tp;
pub type stlp_std__Const_Const_traits_reference<_Tp> = *const _Tp;
pub type stlp_std__Const_Const_traits_pointer<_Tp> = *const _Tp;
pub type stlp_std__Const_Const_traits__ConstTraits = stlp_std__Const_Const_traits;
pub type stlp_std__Const_Const_traits__NonConstTraits = stlp_std__Nonconst_Const_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__Nonconst_Const_traits {
    pub _address: u8,
}
pub type stlp_std__Nonconst_Const_traits_value_type<_Tp> = _Tp;
pub type stlp_std__Nonconst_Const_traits_reference<_Tp> = *const _Tp;
pub type stlp_std__Nonconst_Const_traits_pointer<_Tp> = *const _Tp;
pub type stlp_std__Nonconst_Const_traits__ConstTraits = stlp_std__Const_Const_traits;
pub type stlp_std__Nonconst_Const_traits__NonConstTraits = stlp_std__Nonconst_Const_traits;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_unary_function {
    pub _address: u8,
}
pub type stlp_std_unary_function_argument_type<_Arg> = _Arg;
pub type stlp_std_unary_function_result_type<_Result> = _Result;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_binary_function {
    pub _address: u8,
}
pub type stlp_std_binary_function_first_argument_type<_Arg1> = _Arg1;
pub type stlp_std_binary_function_second_argument_type<_Arg2> = _Arg2;
pub type stlp_std_binary_function_result_type<_Result> = _Result;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_equal_to {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_less {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_plus {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_minus {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_multiplies {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_reverse_iterator<_Iterator> {
    pub current: _Iterator,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iterator>>,
}
pub type stlp_std_reverse_iterator__Self<_Iterator> = stlp_std_reverse_iterator<_Iterator>;
pub type stlp_std_reverse_iterator_difference_type = stlp_std_iterator_traits;
pub type stlp_std_reverse_iterator_pointer = stlp_std_iterator_traits;
pub type stlp_std_reverse_iterator_reference = stlp_std_iterator_traits;
pub type stlp_std_reverse_iterator_iterator_type<_Iterator> = _Iterator;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_back_insert_iterator<_Container> {
    pub container: *mut _Container,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Container>>,
}
pub type stlp_std_back_insert_iterator__Self<_Container> =
    stlp_std_back_insert_iterator<_Container>;
pub type stlp_std_back_insert_iterator_container_type<_Container> = _Container;
pub type stlp_std_back_insert_iterator_iterator_category = stlp_std_output_iterator_tag;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_front_insert_iterator<_Container> {
    pub container: *mut _Container,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Container>>,
}
pub type stlp_std_front_insert_iterator__Self<_Container> =
    stlp_std_front_insert_iterator<_Container>;
pub type stlp_std_front_insert_iterator_container_type<_Container> = _Container;
pub type stlp_std_front_insert_iterator_iterator_category = stlp_std_output_iterator_tag;
#[repr(C)]
pub struct stlp_std_insert_iterator<_Container> {
    pub container: *mut _Container,
    pub _M_iter: [u8; 0usize],
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Container>>,
}
pub type stlp_std_insert_iterator__Self<_Container> = stlp_std_insert_iterator<_Container>;
pub type stlp_std_insert_iterator_container_type<_Container> = _Container;
pub type stlp_std_insert_iterator_iterator_category = stlp_std_output_iterator_tag;
pub type stlp_std___oom_handler_type = ::std::option::Option<unsafe extern "C" fn()>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std___malloc_alloc {
    pub _address: u8,
}
pub type stlp_std___malloc_alloc_value_type = ::std::os::raw::c_char;
#[test]
fn bindgen_test_layout_stlp_std___malloc_alloc() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___malloc_alloc>(),
        1usize,
        concat!("Size of: ", stringify!(stlp_std___malloc_alloc))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___malloc_alloc>(),
        1usize,
        concat!("Alignment of ", stringify!(stlp_std___malloc_alloc))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std14__malloc_alloc8allocateEj"]
    pub fn stlp_std___malloc_alloc_allocate(__n: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std14__malloc_alloc18set_malloc_handlerEPFvvE"]
    pub fn stlp_std___malloc_alloc_set_malloc_handler(
        __f: stlp_std___oom_handler_type,
    ) -> stlp_std___oom_handler_type;
}
impl stlp_std___malloc_alloc {
    #[inline]
    pub unsafe fn allocate(__n: usize) -> *mut ::std::os::raw::c_void {
        stlp_std___malloc_alloc_allocate(__n)
    }
    #[inline]
    pub unsafe fn set_malloc_handler(
        __f: stlp_std___oom_handler_type,
    ) -> stlp_std___oom_handler_type {
        stlp_std___malloc_alloc_set_malloc_handler(__f)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std___new_alloc {
    pub _address: u8,
}
pub type stlp_std___new_alloc_value_type = ::std::os::raw::c_char;
#[test]
fn bindgen_test_layout_stlp_std___new_alloc() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___new_alloc>(),
        1usize,
        concat!("Size of: ", stringify!(stlp_std___new_alloc))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___new_alloc>(),
        1usize,
        concat!("Alignment of ", stringify!(stlp_std___new_alloc))
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std___debug_alloc<_Alloc> {
    pub _base: _Alloc,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Alloc>>,
}
pub type stlp_std___debug_alloc___allocator_type<_Alloc> = _Alloc;
pub type stlp_std___debug_alloc_value_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std___debug_alloc___alloc_header {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u16>,
    pub _M_size: ::std::os::raw::c_ulong,
}
impl stlp_std___debug_alloc___alloc_header {
    #[inline]
    pub fn __magic(&self) -> usize {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set___magic(&mut self, val: usize) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn __type_size(&self) -> usize {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set___type_size(&mut self, val: usize) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        __magic: usize,
        __type_size: usize,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let __magic: u32 = unsafe { ::std::mem::transmute(__magic) };
            __magic as u64
        });
        __bindgen_bitfield_unit.set(16usize, 16u8, {
            let __type_size: u32 = unsafe { ::std::mem::transmute(__type_size) };
            __type_size as u64
        });
        __bindgen_bitfield_unit
    }
}
pub const stlp_std___debug_alloc___pad: stlp_std___debug_alloc__bindgen_ty_1 = 0;
pub const stlp_std___debug_alloc___magic: stlp_std___debug_alloc__bindgen_ty_1 = 0;
pub const stlp_std___debug_alloc___deleted_magic: stlp_std___debug_alloc__bindgen_ty_1 = 0;
pub const stlp_std___debug_alloc___shred_byte: stlp_std___debug_alloc__bindgen_ty_1 = 0;
pub type stlp_std___debug_alloc__bindgen_ty_1 = i32;
pub const stlp_std___debug_alloc___extra_before: stlp_std___debug_alloc__bindgen_ty_2 = 0;
pub const stlp_std___debug_alloc___extra_after: stlp_std___debug_alloc__bindgen_ty_2 = 0;
pub type stlp_std___debug_alloc__bindgen_ty_2 = i32;
pub const _MAX_BYTES: stlp_std__bindgen_ty_1 = 128;
pub type stlp_std__bindgen_ty_1 = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std___node_alloc {
    pub _address: u8,
}
pub type stlp_std___node_alloc_value_type = ::std::os::raw::c_char;
#[test]
fn bindgen_test_layout_stlp_std___node_alloc() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___node_alloc>(),
        1usize,
        concat!("Size of: ", stringify!(stlp_std___node_alloc))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___node_alloc>(),
        1usize,
        concat!("Alignment of ", stringify!(stlp_std___node_alloc))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__Alloc_traits {
    pub _address: u8,
}
pub type stlp_std__Alloc_traits__Orig<_Allocator> = _Allocator;
pub type stlp_std__Alloc_traits__Rebind_type = [u8; 0usize];
pub type stlp_std__Alloc_traits_allocator_type = [u8; 0usize];
pub type stlp_std___alloc_type = stlp_std___malloc_alloc;
pub type stlp_std___sgi_alloc = stlp_std___alloc_type;
pub type stlp_std___single_client_alloc = stlp_std___sgi_alloc;
pub type stlp_std___multithreaded_alloc = stlp_std___sgi_alloc;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_allocator {
    pub _address: u8,
}
pub type stlp_std_allocator_value_type<_Tp> = _Tp;
pub type stlp_std_allocator_pointer<_Tp> = *mut _Tp;
pub type stlp_std_allocator_const_pointer<_Tp> = *const _Tp;
pub type stlp_std_allocator_reference<_Tp> = *mut _Tp;
pub type stlp_std_allocator_const_reference<_Tp> = *const _Tp;
pub type stlp_std_allocator_size_type = usize;
pub type stlp_std_allocator_difference_type = isize;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_allocator_rebind {
    pub _address: u8,
}
pub type stlp_std_allocator_rebind_other = stlp_std_allocator;
#[test]
fn __bindgen_test_layout_stlp_std_allocator_open0_void_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_allocator>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_allocator)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_allocator>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_allocator)
        )
    );
}
pub type stlp_std_streamoff = off64_t;
pub type stlp_std_streamsize = isize;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_fpos<_StateT> {
    pub _M_pos: stlp_std_streamoff,
    pub _M_st: _StateT,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_StateT>>,
}
pub type stlp_std_streampos = stlp_std_fpos<mbstate_t>;
pub type stlp_std_wstreampos = stlp_std_fpos<mbstate_t>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std___char_traits_base {
    pub _address: u8,
}
pub type stlp_std___char_traits_base_char_type<_CharT> = _CharT;
pub type stlp_std___char_traits_base_int_type<_IntT> = _IntT;
pub type stlp_std___char_traits_base_off_type = stlp_std_streamoff;
pub type stlp_std___char_traits_base_pos_type = stlp_std_streampos;
pub type stlp_std___char_traits_base_state_type = mbstate_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_char_traits {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_stlp_std_char_traits_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_char_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_char_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_char_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_char_traits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_char_traits_open0_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_char_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_char_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_char_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_char_traits)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_basic_stringbuf {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_basic_istringstream {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_basic_ostringstream {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_basic_stringstream {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_basic_filebuf {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_basic_ifstream {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_basic_ofstream {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_basic_fstream {
    pub _address: u8,
}
pub type stlp_std_ios = stlp_std_basic_ios<::std::os::raw::c_char>;
pub type stlp_std_wios = stlp_std_basic_ios<u32>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_collate {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_collate_byname {
    pub _address: u8,
}
pub type stlp_std_istream = stlp_std_basic_istream<::std::os::raw::c_char>;
pub type stlp_std_ostream = stlp_std_basic_ostream<::std::os::raw::c_char>;
pub type stlp_std_iostream = stlp_std_basic_iostream<::std::os::raw::c_char>;
pub type stlp_std_streambuf = stlp_std_basic_streambuf<::std::os::raw::c_char>;
pub type stlp_std_stringbuf = stlp_std_basic_stringbuf;
pub type stlp_std_istringstream = stlp_std_basic_istringstream;
pub type stlp_std_ostringstream = stlp_std_basic_ostringstream;
pub type stlp_std_stringstream = stlp_std_basic_stringstream;
pub type stlp_std_filebuf = stlp_std_basic_filebuf;
pub type stlp_std_ifstream = stlp_std_basic_ifstream;
pub type stlp_std_ofstream = stlp_std_basic_ofstream;
pub type stlp_std_fstream = stlp_std_basic_fstream;
pub type stlp_std_wstreambuf = stlp_std_basic_streambuf<u32>;
pub type stlp_std_wistream = stlp_std_basic_istream<u32>;
pub type stlp_std_wostream = stlp_std_basic_ostream<u32>;
pub type stlp_std_wiostream = stlp_std_basic_iostream<u32>;
pub type stlp_std_wstringbuf = stlp_std_basic_stringbuf;
pub type stlp_std_wistringstream = stlp_std_basic_istringstream;
pub type stlp_std_wostringstream = stlp_std_basic_ostringstream;
pub type stlp_std_wstringstream = stlp_std_basic_stringstream;
pub type stlp_std_wfilebuf = stlp_std_basic_filebuf;
pub type stlp_std_wifstream = stlp_std_basic_ifstream;
pub type stlp_std_wofstream = stlp_std_basic_ofstream;
pub type stlp_std_wfstream = stlp_std_basic_fstream;
pub type stlp_std_string = stlp_std_basic_string<::std::os::raw::c_char, stlp_std_allocator>;
pub type stlp_std_wstring = stlp_std_basic_string<u32, stlp_std_allocator>;
#[repr(C)]
pub struct stlp_std_basic_string<_CharT, _Alloc> {
    pub _base: stlp_std_priv___String_base<_CharT, _Alloc>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Alloc>>,
}
pub type stlp_std_basic_string__Base<_CharT, _Alloc> = stlp_std_priv___String_base<_CharT, _Alloc>;
pub type stlp_std_basic_string__Self<_CharT, _Alloc> = stlp_std_basic_string<_CharT, _Alloc>;
pub type stlp_std_basic_string_value_type<_CharT> = _CharT;
pub type stlp_std_basic_string_traits_type<_Traits> = _Traits;
pub type stlp_std_basic_string_pointer<_CharT> = *mut stlp_std_basic_string_value_type<_CharT>;
pub type stlp_std_basic_string_const_pointer<_CharT> =
    *const stlp_std_basic_string_value_type<_CharT>;
pub type stlp_std_basic_string_reference<_CharT> = *mut stlp_std_basic_string_value_type<_CharT>;
pub type stlp_std_basic_string_const_reference<_CharT> =
    *const stlp_std_basic_string_value_type<_CharT>;
pub type stlp_std_basic_string_size_type<_CharT, _Alloc> =
    stlp_std_basic_string__Base<_CharT, _Alloc>;
pub type stlp_std_basic_string_difference_type = isize;
pub type stlp_std_basic_string__Iterator_category = stlp_std_random_access_iterator_tag;
pub type stlp_std_basic_string_const_iterator<_CharT> =
    *const stlp_std_basic_string_value_type<_CharT>;
pub type stlp_std_basic_string_iterator<_CharT> = *mut stlp_std_basic_string_value_type<_CharT>;
pub type stlp_std_basic_string_const_reverse_iterator<_CharT> =
    stlp_std_reverse_iterator<stlp_std_basic_string_const_iterator<_CharT>>;
pub type stlp_std_basic_string_reverse_iterator<_CharT> =
    stlp_std_reverse_iterator<stlp_std_basic_string_iterator<_CharT>>;
pub type stlp_std_basic_string__Reserve_t = stlp_std_priv___String_reserve_t;
pub type stlp_std_basic_string_allocator_type<_CharT, _Alloc> =
    stlp_std_basic_string__Base<_CharT, _Alloc>;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_not_equal_to {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_greater {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_greater_equal {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_less_equal {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_divides {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_modulus {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_negate {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_logical_and {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_logical_or {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_logical_not {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_unary_negate<_Predicate> {
    pub _M_pred: _Predicate,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Predicate>>,
}
pub type stlp_std_unary_negate__Base = stlp_std_unary_function;
pub type stlp_std_unary_negate_argument_type = [u8; 0usize];
pub type stlp_std_unary_negate__ArgParamType = [u8; 0usize];
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_binary_negate<_Predicate> {
    pub _M_pred: _Predicate,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Predicate>>,
}
pub type stlp_std_binary_negate__Base = stlp_std_binary_function;
pub type stlp_std_binary_negate_first_argument_type = [u8; 0usize];
pub type stlp_std_binary_negate_second_argument_type = [u8; 0usize];
pub type stlp_std_binary_negate__FstArgParamType = [u8; 0usize];
pub type stlp_std_binary_negate__SndArgParamType = [u8; 0usize];
#[repr(C)]
pub struct stlp_std_binder1st<_Operation> {
    pub op: _Operation,
    pub _M_value: [u8; 0usize],
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Operation>>,
}
pub type stlp_std_binder1st__Base = stlp_std_unary_function;
pub type stlp_std_binder1st_argument_type = [u8; 0usize];
pub type stlp_std_binder1st_result_type = [u8; 0usize];
pub type stlp_std_binder1st__ArgParamType = [u8; 0usize];
pub type stlp_std_binder1st__ConstArgParamType = [u8; 0usize];
pub type stlp_std_binder1st__ValueParamType = [u8; 0usize];
#[repr(C)]
pub struct stlp_std_binder2nd<_Operation> {
    pub op: _Operation,
    pub value: [u8; 0usize],
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Operation>>,
}
pub type stlp_std_binder2nd__Base = stlp_std_unary_function;
pub type stlp_std_binder2nd_argument_type = [u8; 0usize];
pub type stlp_std_binder2nd_result_type = [u8; 0usize];
pub type stlp_std_binder2nd__ArgParamType = [u8; 0usize];
pub type stlp_std_binder2nd__ConstArgParamType = [u8; 0usize];
pub type stlp_std_binder2nd__ValueParamType = [u8; 0usize];
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_unary_compose<_Operation1, _Operation2> {
    pub _M_fn1: _Operation1,
    pub _M_fn2: _Operation2,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Operation1>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Operation2>>,
}
pub type stlp_std_unary_compose__Base = stlp_std_unary_function;
pub type stlp_std_unary_compose_argument_type = [u8; 0usize];
pub type stlp_std_unary_compose_result_type = [u8; 0usize];
pub type stlp_std_unary_compose__ArgParamType = [u8; 0usize];
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_binary_compose<_Operation1, _Operation2, _Operation3> {
    pub _M_fn1: _Operation1,
    pub _M_fn2: _Operation2,
    pub _M_fn3: _Operation3,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Operation1>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Operation2>>,
    pub _phantom_2: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Operation3>>,
}
pub type stlp_std_binary_compose__Base = stlp_std_unary_function;
pub type stlp_std_binary_compose_argument_type = [u8; 0usize];
pub type stlp_std_binary_compose_result_type = [u8; 0usize];
pub type stlp_std_binary_compose__ArgParamType = [u8; 0usize];
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_identity {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_select1st {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_select2nd {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_project1st {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_project2nd {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_constant_void_fun<_Result> {
    pub _base: stlp_std_priv___Constant_void_fun<_Result>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Result>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_constant_unary_fun<_Result> {
    pub _base: stlp_std_priv___Constant_unary_fun<_Result>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Result>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_constant_binary_fun<_Result> {
    pub _base: stlp_std_priv___Constant_binary_fun<_Result>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Result>>,
}
#[repr(C)]
pub struct stlp_std_subtractive_rng {
    pub _M_table: [::std::os::raw::c_ulong; 55usize],
    pub _M_index1: ::std::os::raw::c_ulong,
    pub _M_index2: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_stlp_std_subtractive_rng() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_subtractive_rng>(),
        228usize,
        concat!("Size of: ", stringify!(stlp_std_subtractive_rng))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_subtractive_rng>(),
        4usize,
        concat!("Alignment of ", stringify!(stlp_std_subtractive_rng))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<stlp_std_subtractive_rng>()))._M_table as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_subtractive_rng),
            "::",
            stringify!(_M_table)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<stlp_std_subtractive_rng>()))._M_index1 as *const _ as usize
        },
        220usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_subtractive_rng),
            "::",
            stringify!(_M_index1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<stlp_std_subtractive_rng>()))._M_index2 as *const _ as usize
        },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_subtractive_rng),
            "::",
            stringify!(_M_index2)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_mem_fun_t<_Ret> {
    pub _M_f: stlp_std_mem_fun_t___fun_type<_Ret>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ret>>,
}
pub type stlp_std_mem_fun_t___fun_type<_Ret> =
    ::std::option::Option<unsafe extern "C" fn() -> _Ret>;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_const_mem_fun_t<_Ret> {
    pub _M_f: stlp_std_const_mem_fun_t___fun_type<_Ret>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ret>>,
}
pub type stlp_std_const_mem_fun_t___fun_type<_Ret> =
    ::std::option::Option<unsafe extern "C" fn() -> _Ret>;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_mem_fun_ref_t<_Ret> {
    pub _M_f: stlp_std_mem_fun_ref_t___fun_type<_Ret>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ret>>,
}
pub type stlp_std_mem_fun_ref_t___fun_type<_Ret> =
    ::std::option::Option<unsafe extern "C" fn() -> _Ret>;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_const_mem_fun_ref_t<_Ret> {
    pub _M_f: stlp_std_const_mem_fun_ref_t___fun_type<_Ret>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ret>>,
}
pub type stlp_std_const_mem_fun_ref_t___fun_type<_Ret> =
    ::std::option::Option<unsafe extern "C" fn() -> _Ret>;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_mem_fun1_t<_Ret, _Arg> {
    pub _M_f: stlp_std_mem_fun1_t___fun_type<_Ret, _Arg>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ret>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Arg>>,
}
pub type stlp_std_mem_fun1_t___fun_type<_Ret, _Arg> =
    ::std::option::Option<unsafe extern "C" fn(arg1: _Arg) -> _Ret>;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_const_mem_fun1_t<_Ret, _Arg> {
    pub _M_f: stlp_std_const_mem_fun1_t___fun_type<_Ret, _Arg>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ret>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Arg>>,
}
pub type stlp_std_const_mem_fun1_t___fun_type<_Ret, _Arg> =
    ::std::option::Option<unsafe extern "C" fn(arg1: _Arg) -> _Ret>;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_mem_fun1_ref_t<_Ret, _Arg> {
    pub _M_f: stlp_std_mem_fun1_ref_t___fun_type<_Ret, _Arg>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ret>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Arg>>,
}
pub type stlp_std_mem_fun1_ref_t___fun_type<_Ret, _Arg> =
    ::std::option::Option<unsafe extern "C" fn(arg1: _Arg) -> _Ret>;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_const_mem_fun1_ref_t<_Ret, _Arg> {
    pub _M_f: stlp_std_const_mem_fun1_ref_t___fun_type<_Ret, _Arg>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ret>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Arg>>,
}
pub type stlp_std_const_mem_fun1_ref_t___fun_type<_Ret, _Arg> =
    ::std::option::Option<unsafe extern "C" fn(arg1: _Arg) -> _Ret>;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_pointer_to_unary_function<_Arg, _Result> {
    pub _M_ptr: ::std::option::Option<unsafe extern "C" fn(arg1: _Arg) -> _Result>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Arg>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Result>>,
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_pointer_to_binary_function<_Arg1, _Arg2, _Result> {
    pub _M_ptr: ::std::option::Option<unsafe extern "C" fn(arg1: _Arg1, arg2: _Arg2) -> _Result>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Arg1>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Arg2>>,
    pub _phantom_2: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Result>>,
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std25__stl_throw_runtime_errorEPKc"]
    pub fn stlp_std___stl_throw_runtime_error(__msg: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std23__stl_throw_range_errorEPKc"]
    pub fn stlp_std___stl_throw_range_error(__msg: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std24__stl_throw_out_of_rangeEPKc"]
    pub fn stlp_std___stl_throw_out_of_range(__msg: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std24__stl_throw_length_errorEPKc"]
    pub fn stlp_std___stl_throw_length_error(__msg: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std28__stl_throw_invalid_argumentEPKc"]
    pub fn stlp_std___stl_throw_invalid_argument(__msg: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std26__stl_throw_overflow_errorEPKc"]
    pub fn stlp_std___stl_throw_overflow_error(__msg: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "\u{1}npos"]
    pub static stlp_std_npos: usize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_hash {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_stlp_std_hash_open0_ptr_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_hash>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_hash)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_hash_open0_ptr_const_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_hash>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_hash)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_hash_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_hash>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_hash)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_hash_open0_unsigned_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_hash>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_hash)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_hash_open0_signed_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_hash>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_hash)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_hash_open0_short_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_hash>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_hash)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_hash_open0_unsigned_short_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_hash>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_hash)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_hash_open0_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_hash>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_hash)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_hash_open0_unsigned_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_hash>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_hash)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_hash_open0_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_hash>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_hash)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_hash_open0_unsigned_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_hash>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_hash)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_hash)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_hash_open0_ptr_void_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_hash>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_hash)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_hash>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_hash)
        )
    );
}
#[repr(C)]
pub struct stlp_std___Named_exception {
    pub _base: std_exception,
    pub _M_static_name: [::std::os::raw::c_char; 256usize],
    pub _M_name: *mut ::std::os::raw::c_char,
}
pub const stlp_std___Named_exception__S_bufsize: stlp_std___Named_exception__bindgen_ty_1 = 256;
pub type stlp_std___Named_exception__bindgen_ty_1 = u32;
#[test]
fn bindgen_test_layout_stlp_std___Named_exception() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___Named_exception>(),
        264usize,
        concat!("Size of: ", stringify!(stlp_std___Named_exception))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___Named_exception>(),
        4usize,
        concat!("Alignment of ", stringify!(stlp_std___Named_exception))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<stlp_std___Named_exception>()))._M_static_name as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std___Named_exception),
            "::",
            stringify!(_M_static_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<stlp_std___Named_exception>()))._M_name as *const _ as usize
        },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std___Named_exception),
            "::",
            stringify!(_M_name)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std17__Named_exceptionC1ERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"]
    pub fn stlp_std___Named_exception___Named_exception(
        this: *mut stlp_std___Named_exception,
        __str: *const stlp_std_string,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std17__Named_exceptionC1ERKS0_"]
    pub fn stlp_std___Named_exception___Named_exception1(
        this: *mut stlp_std___Named_exception,
        arg1: *const stlp_std___Named_exception,
    );
}
impl stlp_std___Named_exception {
    #[inline]
    pub unsafe fn new(__str: *const stlp_std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        stlp_std___Named_exception___Named_exception(&mut __bindgen_tmp, __str);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new1(arg1: *const stlp_std___Named_exception) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        stlp_std___Named_exception___Named_exception1(&mut __bindgen_tmp, arg1);
        __bindgen_tmp
    }
}
extern "C" {
    #[link_name = "\u{1}_ZNK8stlp_std17__Named_exception4whatEv"]
    pub fn stlp_std___Named_exception_what(
        this: *mut ::std::os::raw::c_void,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std17__Named_exceptionD1Ev"]
    pub fn stlp_std___Named_exception___Named_exception_destructor(
        this: *mut stlp_std___Named_exception,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__STLP_mutex_base {
    pub _M_lock: pthread_spinlock_t,
}
#[test]
fn bindgen_test_layout_stlp_std__STLP_mutex_base() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std__STLP_mutex_base>(),
        4usize,
        concat!("Size of: ", stringify!(stlp_std__STLP_mutex_base))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std__STLP_mutex_base>(),
        4usize,
        concat!("Alignment of ", stringify!(stlp_std__STLP_mutex_base))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<stlp_std__STLP_mutex_base>()))._M_lock as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std__STLP_mutex_base),
            "::",
            stringify!(_M_lock)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std__STLP_mutex {
    pub _base: stlp_std__STLP_mutex_base,
}
#[test]
fn bindgen_test_layout_stlp_std__STLP_mutex() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std__STLP_mutex>(),
        4usize,
        concat!("Size of: ", stringify!(stlp_std__STLP_mutex))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std__STLP_mutex>(),
        4usize,
        concat!("Alignment of ", stringify!(stlp_std__STLP_mutex))
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std__STLP_auto_lock {
    pub _M_lock: *mut stlp_std__STLP_mutex,
}
#[test]
fn bindgen_test_layout_stlp_std__STLP_auto_lock() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std__STLP_auto_lock>(),
        4usize,
        concat!("Size of: ", stringify!(stlp_std__STLP_auto_lock))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std__STLP_auto_lock>(),
        4usize,
        concat!("Alignment of ", stringify!(stlp_std__STLP_auto_lock))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<stlp_std__STLP_auto_lock>()))._M_lock as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std__STLP_auto_lock),
            "::",
            stringify!(_M_lock)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__Refcount_Base {
    pub _M_ref_count: __stl_atomic_t,
}
#[test]
fn bindgen_test_layout_stlp_std__Refcount_Base() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std__Refcount_Base>(),
        4usize,
        concat!("Size of: ", stringify!(stlp_std__Refcount_Base))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std__Refcount_Base>(),
        4usize,
        concat!("Alignment of ", stringify!(stlp_std__Refcount_Base))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<stlp_std__Refcount_Base>()))._M_ref_count as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std__Refcount_Base),
            "::",
            stringify!(_M_ref_count)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_S_swap_lock"]
    pub static mut stlp_std__Atomic_swap_struct__S_swap_lock: stlp_std__STLP_mutex;
}
extern "C" {
    #[link_name = "\u{1}_S_swap_lock"]
    pub static mut stlp_std__S_swap_lock: stlp_std__STLP_mutex;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_money_get {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_money_put {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_time_get {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_time_put {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__Locale_impl {
    _unused: [u8; 0],
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std16_get_Locale_implEPNS_12_Locale_implE"]
    pub fn stlp_std__get_Locale_impl(
        locimpl: *mut stlp_std__Locale_impl,
    ) -> *mut stlp_std__Locale_impl;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std26_copy_Nameless_Locale_implEPNS_12_Locale_implE"]
    pub fn stlp_std__copy_Nameless_Locale_impl(
        locimpl: *mut stlp_std__Locale_impl,
    ) -> *mut stlp_std__Locale_impl;
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_locale {
    pub _M_impl: *mut stlp_std__Locale_impl,
}
#[repr(C)]
pub struct stlp_std_locale_facet__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_locale_facet {
    pub vtable_: *const stlp_std_locale_facet__bindgen_vtable,
    pub _base: stlp_std__Refcount_Base,
}
#[test]
fn bindgen_test_layout_stlp_std_locale_facet() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_locale_facet>(),
        8usize,
        concat!("Size of: ", stringify!(stlp_std_locale_facet))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_locale_facet>(),
        4usize,
        concat!("Alignment of ", stringify!(stlp_std_locale_facet))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_locale_id {
    pub _M_index: usize,
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std6locale2id6_S_maxE"]
    pub static mut stlp_std_locale_id__S_max: usize;
}
#[test]
fn bindgen_test_layout_stlp_std_locale_id() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_locale_id>(),
        4usize,
        concat!("Size of: ", stringify!(stlp_std_locale_id))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_locale_id>(),
        4usize,
        concat!("Alignment of ", stringify!(stlp_std_locale_id))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stlp_std_locale_id>()))._M_index as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_locale_id),
            "::",
            stringify!(_M_index)
        )
    );
}
pub type stlp_std_locale_category = ::std::os::raw::c_int;
pub const stlp_std_locale_none: stlp_std_locale_category = 0;
pub const stlp_std_locale_collate: stlp_std_locale_category = 16;
pub const stlp_std_locale_ctype: stlp_std_locale_category = 32;
pub const stlp_std_locale_monetary: stlp_std_locale_category = 64;
pub const stlp_std_locale_numeric: stlp_std_locale_category = 256;
pub const stlp_std_locale_time: stlp_std_locale_category = 512;
pub const stlp_std_locale_messages: stlp_std_locale_category = 1024;
pub const stlp_std_locale_all: stlp_std_locale_category = 1904;
#[test]
fn bindgen_test_layout_stlp_std_locale() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_locale>(),
        4usize,
        concat!("Size of: ", stringify!(stlp_std_locale))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_locale>(),
        4usize,
        concat!("Alignment of ", stringify!(stlp_std_locale))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stlp_std_locale>()))._M_impl as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_locale),
            "::",
            stringify!(_M_impl)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK8stlp_std6locale4nameEv"]
    pub fn stlp_std_locale_name(this: *const stlp_std_locale) -> stlp_std_string;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std6locale6globalERKS0_"]
    pub fn stlp_std_locale_global(arg1: *const stlp_std_locale) -> stlp_std_locale;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std6locale7classicEv"]
    pub fn stlp_std_locale_classic() -> *const stlp_std_locale;
}
extern "C" {
    #[link_name = "\u{1}_ZNK8stlp_std6locale12_M_get_facetERKNS0_2idE"]
    pub fn stlp_std_locale__M_get_facet(
        this: *const stlp_std_locale,
        arg1: *const stlp_std_locale_id,
    ) -> *mut stlp_std_locale_facet;
}
extern "C" {
    #[link_name = "\u{1}_ZNK8stlp_std6locale12_M_use_facetERKNS0_2idE"]
    pub fn stlp_std_locale__M_use_facet(
        this: *const stlp_std_locale,
        arg1: *const stlp_std_locale_id,
    ) -> *mut stlp_std_locale_facet;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std6locale25_M_throw_on_combine_errorERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"]
    pub fn stlp_std_locale__M_throw_on_combine_error(name: *const stlp_std_string);
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std6locale21_M_throw_on_null_nameEv"]
    pub fn stlp_std_locale__M_throw_on_null_name();
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std6locale28_M_throw_on_creation_failureEiPKcS2_"]
    pub fn stlp_std_locale__M_throw_on_creation_failure(
        __err_code: ::std::os::raw::c_int,
        name: *const ::std::os::raw::c_char,
        facet: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std6locale9_M_insertEPNS0_5facetERNS0_2idE"]
    pub fn stlp_std_locale__M_insert(
        this: *mut stlp_std_locale,
        __f: *mut stlp_std_locale_facet,
        __id: *mut stlp_std_locale_id,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std6localeC1Ev"]
    pub fn stlp_std_locale_locale(this: *mut stlp_std_locale);
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std6localeC1ERKS0_"]
    pub fn stlp_std_locale_locale1(this: *mut stlp_std_locale, arg1: *const stlp_std_locale);
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std6localeC1EPKc"]
    pub fn stlp_std_locale_locale2(this: *mut stlp_std_locale, arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std6localeC1ERKS0_PKci"]
    pub fn stlp_std_locale_locale3(
        this: *mut stlp_std_locale,
        arg1: *const stlp_std_locale,
        arg2: *const ::std::os::raw::c_char,
        arg3: stlp_std_locale_category,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std6localeC1EPNS_12_Locale_implE"]
    pub fn stlp_std_locale_locale4(this: *mut stlp_std_locale, arg1: *mut stlp_std__Locale_impl);
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std6localeC1ERKS0_S2_i"]
    pub fn stlp_std_locale_locale5(
        this: *mut stlp_std_locale,
        arg1: *const stlp_std_locale,
        arg2: *const stlp_std_locale,
        arg3: stlp_std_locale_category,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std6localeD1Ev"]
    pub fn stlp_std_locale_locale_destructor(this: *mut stlp_std_locale);
}
impl stlp_std_locale {
    #[inline]
    pub unsafe fn name(&self) -> stlp_std_string {
        stlp_std_locale_name(self)
    }
    #[inline]
    pub unsafe fn global(arg1: *const stlp_std_locale) -> stlp_std_locale {
        stlp_std_locale_global(arg1)
    }
    #[inline]
    pub unsafe fn classic() -> *const stlp_std_locale {
        stlp_std_locale_classic()
    }
    #[inline]
    pub unsafe fn _M_get_facet(
        &self,
        arg1: *const stlp_std_locale_id,
    ) -> *mut stlp_std_locale_facet {
        stlp_std_locale__M_get_facet(self, arg1)
    }
    #[inline]
    pub unsafe fn _M_use_facet(
        &self,
        arg1: *const stlp_std_locale_id,
    ) -> *mut stlp_std_locale_facet {
        stlp_std_locale__M_use_facet(self, arg1)
    }
    #[inline]
    pub unsafe fn _M_throw_on_combine_error(name: *const stlp_std_string) {
        stlp_std_locale__M_throw_on_combine_error(name)
    }
    #[inline]
    pub unsafe fn _M_throw_on_null_name() {
        stlp_std_locale__M_throw_on_null_name()
    }
    #[inline]
    pub unsafe fn _M_throw_on_creation_failure(
        __err_code: ::std::os::raw::c_int,
        name: *const ::std::os::raw::c_char,
        facet: *const ::std::os::raw::c_char,
    ) {
        stlp_std_locale__M_throw_on_creation_failure(__err_code, name, facet)
    }
    #[inline]
    pub unsafe fn _M_insert(
        &mut self,
        __f: *mut stlp_std_locale_facet,
        __id: *mut stlp_std_locale_id,
    ) {
        stlp_std_locale__M_insert(self, __f, __id)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        stlp_std_locale_locale(&mut __bindgen_tmp);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new1(arg1: *const stlp_std_locale) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        stlp_std_locale_locale1(&mut __bindgen_tmp, arg1);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new2(arg1: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        stlp_std_locale_locale2(&mut __bindgen_tmp, arg1);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new3(
        arg1: *const stlp_std_locale,
        arg2: *const ::std::os::raw::c_char,
        arg3: stlp_std_locale_category,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        stlp_std_locale_locale3(&mut __bindgen_tmp, arg1, arg2, arg3);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new4(arg1: *mut stlp_std__Locale_impl) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        stlp_std_locale_locale4(&mut __bindgen_tmp, arg1);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new5(
        arg1: *const stlp_std_locale,
        arg2: *const stlp_std_locale,
        arg3: stlp_std_locale_category,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        stlp_std_locale_locale5(&mut __bindgen_tmp, arg1, arg2, arg3);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        stlp_std_locale_locale_destructor(self)
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std6locale5facetD1Ev"]
    pub fn stlp_std_locale_facet_facet_destructor(this: *mut stlp_std_locale_facet);
}
#[repr(C)]
pub struct stlp_std_ios_base__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_ios_base {
    pub vtable_: *const stlp_std_ios_base__bindgen_vtable,
    pub _M_fmtflags: stlp_std_ios_base_fmtflags,
    pub _M_iostate: stlp_std_ios_base_iostate,
    pub _M_openmode: stlp_std_ios_base_openmode,
    pub _M_seekdir: stlp_std_ios_base_seekdir,
    pub _M_exception_mask: stlp_std_ios_base_iostate,
    pub _M_precision: stlp_std_streamsize,
    pub _M_width: stlp_std_streamsize,
    pub _M_locale: stlp_std_locale,
    pub _M_callbacks: *mut stlp_std_pair<stlp_std_ios_base_event_callback, ::std::os::raw::c_int>,
    pub _M_num_callbacks: usize,
    pub _M_callback_index: usize,
    pub _M_iwords: *mut ::std::os::raw::c_long,
    pub _M_num_iwords: usize,
    pub _M_pwords: *mut *mut ::std::os::raw::c_void,
    pub _M_num_pwords: usize,
}
#[repr(C)]
pub struct stlp_std_ios_base_failure {
    pub _base: stlp_std___Named_exception,
}
#[test]
fn bindgen_test_layout_stlp_std_ios_base_failure() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_ios_base_failure>(),
        264usize,
        concat!("Size of: ", stringify!(stlp_std_ios_base_failure))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_ios_base_failure>(),
        4usize,
        concat!("Alignment of ", stringify!(stlp_std_ios_base_failure))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std8ios_base7failureC1ERKNS_12basic_stringIcNS_11char_traitsIcEENS_9allocatorIcEEEE"]
    pub fn stlp_std_ios_base_failure_failure(
        this: *mut stlp_std_ios_base_failure,
        arg1: *const stlp_std_string,
    );
}
impl stlp_std_ios_base_failure {
    #[inline]
    pub unsafe fn new(arg1: *const stlp_std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        stlp_std_ios_base_failure_failure(&mut __bindgen_tmp, arg1);
        __bindgen_tmp
    }
}
pub type stlp_std_ios_base_fmtflags = ::std::os::raw::c_int;
pub type stlp_std_ios_base_iostate = ::std::os::raw::c_int;
pub type stlp_std_ios_base_openmode = ::std::os::raw::c_int;
pub type stlp_std_ios_base_seekdir = ::std::os::raw::c_int;
pub type stlp_std_ios_base_fmt_flags = stlp_std_ios_base_fmtflags;
pub const stlp_std_ios_base_event_erase_event: stlp_std_ios_base_event = 0;
pub const stlp_std_ios_base_event_imbue_event: stlp_std_ios_base_event = 1;
pub const stlp_std_ios_base_event_copyfmt_event: stlp_std_ios_base_event = 2;
pub type stlp_std_ios_base_event = u32;
pub type stlp_std_ios_base_event_callback = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: stlp_std_ios_base_event,
        arg2: *mut stlp_std_ios_base,
        __index: ::std::os::raw::c_int,
    ),
>;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_ios_base_Init {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std8ios_base4Init8_S_countE"]
    pub static mut stlp_std_ios_base_Init__S_count: ::std::os::raw::c_long;
}
#[test]
fn bindgen_test_layout_stlp_std_ios_base_Init() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_ios_base_Init>(),
        1usize,
        concat!("Size of: ", stringify!(stlp_std_ios_base_Init))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_ios_base_Init>(),
        1usize,
        concat!("Alignment of ", stringify!(stlp_std_ios_base_Init))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std8ios_base4InitC1Ev"]
    pub fn stlp_std_ios_base_Init_Init(this: *mut stlp_std_ios_base_Init);
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std8ios_base4InitD1Ev"]
    pub fn stlp_std_ios_base_Init_Init_destructor(this: *mut stlp_std_ios_base_Init);
}
impl stlp_std_ios_base_Init {
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        stlp_std_ios_base_Init_Init(&mut __bindgen_tmp);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        stlp_std_ios_base_Init_Init_destructor(self)
    }
}
pub type stlp_std_ios_base_io_state = stlp_std_ios_base_iostate;
pub type stlp_std_ios_base_open_mode = stlp_std_ios_base_openmode;
pub type stlp_std_ios_base_seek_dir = stlp_std_ios_base_seekdir;
pub type stlp_std_ios_base_streamoff = stlp_std_streamoff;
pub type stlp_std_ios_base_streampos = stlp_std_streampos;
pub const stlp_std_ios_base_left: ::std::os::raw::c_int = 1;
pub const stlp_std_ios_base_right: ::std::os::raw::c_int = 2;
pub const stlp_std_ios_base_internal: ::std::os::raw::c_int = 4;
pub const stlp_std_ios_base_dec: ::std::os::raw::c_int = 8;
pub const stlp_std_ios_base_hex: ::std::os::raw::c_int = 16;
pub const stlp_std_ios_base_oct: ::std::os::raw::c_int = 32;
pub const stlp_std_ios_base_fixed: ::std::os::raw::c_int = 64;
pub const stlp_std_ios_base_scientific: ::std::os::raw::c_int = 128;
pub const stlp_std_ios_base_boolalpha: ::std::os::raw::c_int = 256;
pub const stlp_std_ios_base_showbase: ::std::os::raw::c_int = 512;
pub const stlp_std_ios_base_showpoint: ::std::os::raw::c_int = 1024;
pub const stlp_std_ios_base_showpos: ::std::os::raw::c_int = 2048;
pub const stlp_std_ios_base_skipws: ::std::os::raw::c_int = 4096;
pub const stlp_std_ios_base_unitbuf: ::std::os::raw::c_int = 8192;
pub const stlp_std_ios_base_uppercase: ::std::os::raw::c_int = 16384;
pub const stlp_std_ios_base_adjustfield: ::std::os::raw::c_int = 7;
pub const stlp_std_ios_base_basefield: ::std::os::raw::c_int = 56;
pub const stlp_std_ios_base_floatfield: ::std::os::raw::c_int = 192;
pub const stlp_std_ios_base_goodbit: ::std::os::raw::c_int = 0;
pub const stlp_std_ios_base_badbit: ::std::os::raw::c_int = 1;
pub const stlp_std_ios_base_eofbit: ::std::os::raw::c_int = 2;
pub const stlp_std_ios_base_failbit: ::std::os::raw::c_int = 4;
pub const stlp_std_ios_base___default_mode: ::std::os::raw::c_int = 0;
pub const stlp_std_ios_base_app: ::std::os::raw::c_int = 1;
pub const stlp_std_ios_base_ate: ::std::os::raw::c_int = 2;
pub const stlp_std_ios_base_binary: ::std::os::raw::c_int = 4;
pub const stlp_std_ios_base_in: ::std::os::raw::c_int = 8;
pub const stlp_std_ios_base_out: ::std::os::raw::c_int = 16;
pub const stlp_std_ios_base_trunc: ::std::os::raw::c_int = 32;
pub const stlp_std_ios_base_beg: ::std::os::raw::c_int = 1;
pub const stlp_std_ios_base_cur: ::std::os::raw::c_int = 2;
pub const stlp_std_ios_base_end: ::std::os::raw::c_int = 4;
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std8ios_base12_S_is_syncedE"]
    pub static mut stlp_std_ios_base__S_is_synced: bool;
}
#[test]
fn bindgen_test_layout_stlp_std_ios_base() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_ios_base>(),
        64usize,
        concat!("Size of: ", stringify!(stlp_std_ios_base))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_ios_base>(),
        4usize,
        concat!("Alignment of ", stringify!(stlp_std_ios_base))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stlp_std_ios_base>()))._M_fmtflags as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_ios_base),
            "::",
            stringify!(_M_fmtflags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stlp_std_ios_base>()))._M_iostate as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_ios_base),
            "::",
            stringify!(_M_iostate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stlp_std_ios_base>()))._M_openmode as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_ios_base),
            "::",
            stringify!(_M_openmode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stlp_std_ios_base>()))._M_seekdir as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_ios_base),
            "::",
            stringify!(_M_seekdir)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<stlp_std_ios_base>()))._M_exception_mask as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_ios_base),
            "::",
            stringify!(_M_exception_mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stlp_std_ios_base>()))._M_precision as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_ios_base),
            "::",
            stringify!(_M_precision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stlp_std_ios_base>()))._M_width as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_ios_base),
            "::",
            stringify!(_M_width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stlp_std_ios_base>()))._M_locale as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_ios_base),
            "::",
            stringify!(_M_locale)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stlp_std_ios_base>()))._M_callbacks as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_ios_base),
            "::",
            stringify!(_M_callbacks)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<stlp_std_ios_base>()))._M_num_callbacks as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_ios_base),
            "::",
            stringify!(_M_num_callbacks)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<stlp_std_ios_base>()))._M_callback_index as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_ios_base),
            "::",
            stringify!(_M_callback_index)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stlp_std_ios_base>()))._M_iwords as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_ios_base),
            "::",
            stringify!(_M_iwords)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stlp_std_ios_base>()))._M_num_iwords as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_ios_base),
            "::",
            stringify!(_M_num_iwords)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stlp_std_ios_base>()))._M_pwords as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_ios_base),
            "::",
            stringify!(_M_pwords)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stlp_std_ios_base>()))._M_num_pwords as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(stlp_std_ios_base),
            "::",
            stringify!(_M_num_pwords)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std8ios_base5imbueERKNS_6localeE"]
    pub fn stlp_std_ios_base_imbue(
        this: *mut stlp_std_ios_base,
        arg1: *const stlp_std_locale,
    ) -> stlp_std_locale;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std8ios_base6xallocEv"]
    pub fn stlp_std_ios_base_xalloc() -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std8ios_base5iwordEi"]
    pub fn stlp_std_ios_base_iword(
        this: *mut stlp_std_ios_base,
        __index: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std8ios_base5pwordEi"]
    pub fn stlp_std_ios_base_pword(
        this: *mut stlp_std_ios_base,
        __index: ::std::os::raw::c_int,
    ) -> *mut *mut ::std::os::raw::c_void;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std8ios_base17register_callbackEPFvNS0_5eventERS0_iEi"]
    pub fn stlp_std_ios_base_register_callback(
        this: *mut stlp_std_ios_base,
        __fn: stlp_std_ios_base_event_callback,
        __index: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std8ios_base15sync_with_stdioEb"]
    pub fn stlp_std_ios_base_sync_with_stdio(__sync: bool) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std8ios_base13_M_copy_stateERKS0_"]
    pub fn stlp_std_ios_base__M_copy_state(
        this: *mut stlp_std_ios_base,
        __x: *const stlp_std_ios_base,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std8ios_base19_M_invoke_callbacksENS0_5eventE"]
    pub fn stlp_std_ios_base__M_invoke_callbacks(
        this: *mut stlp_std_ios_base,
        arg1: stlp_std_ios_base_event,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std8ios_base16_M_throw_failureEv"]
    pub fn stlp_std_ios_base__M_throw_failure(this: *mut stlp_std_ios_base);
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std8ios_base13_S_initializeEv"]
    pub fn stlp_std_ios_base__S_initialize();
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std8ios_base15_S_uninitializeEv"]
    pub fn stlp_std_ios_base__S_uninitialize();
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std8ios_baseC1Ev"]
    pub fn stlp_std_ios_base_ios_base(this: *mut stlp_std_ios_base);
}
impl stlp_std_ios_base {
    #[inline]
    pub unsafe fn imbue(&mut self, arg1: *const stlp_std_locale) -> stlp_std_locale {
        stlp_std_ios_base_imbue(self, arg1)
    }
    #[inline]
    pub unsafe fn xalloc() -> ::std::os::raw::c_int {
        stlp_std_ios_base_xalloc()
    }
    #[inline]
    pub unsafe fn iword(&mut self, __index: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_long {
        stlp_std_ios_base_iword(self, __index)
    }
    #[inline]
    pub unsafe fn pword(
        &mut self,
        __index: ::std::os::raw::c_int,
    ) -> *mut *mut ::std::os::raw::c_void {
        stlp_std_ios_base_pword(self, __index)
    }
    #[inline]
    pub unsafe fn register_callback(
        &mut self,
        __fn: stlp_std_ios_base_event_callback,
        __index: ::std::os::raw::c_int,
    ) {
        stlp_std_ios_base_register_callback(self, __fn, __index)
    }
    #[inline]
    pub unsafe fn sync_with_stdio(__sync: bool) -> bool {
        stlp_std_ios_base_sync_with_stdio(__sync)
    }
    #[inline]
    pub unsafe fn _M_copy_state(&mut self, __x: *const stlp_std_ios_base) {
        stlp_std_ios_base__M_copy_state(self, __x)
    }
    #[inline]
    pub unsafe fn _M_invoke_callbacks(&mut self, arg1: stlp_std_ios_base_event) {
        stlp_std_ios_base__M_invoke_callbacks(self, arg1)
    }
    #[inline]
    pub unsafe fn _M_throw_failure(&mut self) {
        stlp_std_ios_base__M_throw_failure(self)
    }
    #[inline]
    pub unsafe fn _S_initialize() {
        stlp_std_ios_base__S_initialize()
    }
    #[inline]
    pub unsafe fn _S_uninitialize() {
        stlp_std_ios_base__S_uninitialize()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        stlp_std_ios_base_ios_base(&mut __bindgen_tmp);
        __bindgen_tmp
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std8ios_base7failureD1Ev"]
    pub fn stlp_std_ios_base_failure_failure_destructor(this: *mut stlp_std_ios_base_failure);
}
extern "C" {
    #[link_name = "\u{1}_ZN8stlp_std8ios_baseD1Ev"]
    pub fn stlp_std_ios_base_ios_base_destructor(this: *mut stlp_std_ios_base);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_ctype_base {
    pub _address: u8,
}
pub const stlp_std_ctype_base_mask_space: stlp_std_ctype_base_mask = 8192;
pub const stlp_std_ctype_base_mask_print: stlp_std_ctype_base_mask = 16384;
pub const stlp_std_ctype_base_mask_cntrl: stlp_std_ctype_base_mask = 2;
pub const stlp_std_ctype_base_mask_upper: stlp_std_ctype_base_mask = 256;
pub const stlp_std_ctype_base_mask_lower: stlp_std_ctype_base_mask = 512;
pub const stlp_std_ctype_base_mask_alpha: stlp_std_ctype_base_mask = 1024;
pub const stlp_std_ctype_base_mask_digit: stlp_std_ctype_base_mask = 2048;
pub const stlp_std_ctype_base_mask_punct: stlp_std_ctype_base_mask = 4;
pub const stlp_std_ctype_base_mask_xdigit: stlp_std_ctype_base_mask = 4096;
pub const stlp_std_ctype_base_mask_alnum: stlp_std_ctype_base_mask = 3072;
pub const stlp_std_ctype_base_mask_graph: stlp_std_ctype_base_mask = 3076;
pub type stlp_std_ctype_base_mask = u32;
#[test]
fn bindgen_test_layout_stlp_std_ctype_base() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_ctype_base>(),
        1usize,
        concat!("Size of: ", stringify!(stlp_std_ctype_base))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_ctype_base>(),
        1usize,
        concat!("Alignment of ", stringify!(stlp_std_ctype_base))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_ctype {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_ctype_byname {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_stlp_std_ctype_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_ctype>(),
        16usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_ctype)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_ctype>(),
        4usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_ctype)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_ctype_byname_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_ctype_byname>(),
        1044usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_ctype_byname)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_ctype_byname>(),
        4usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_ctype_byname)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_ctype_open0_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_ctype>(),
        8usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_ctype)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_ctype>(),
        4usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_ctype)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_ctype_byname_open0_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_ctype_byname>(),
        12usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_ctype_byname)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_ctype_byname>(),
        4usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_ctype_byname)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_numpunct {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_numpunct_byname {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_stlp_std_numpunct_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_numpunct>(),
        8usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_numpunct)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_numpunct>(),
        4usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_numpunct)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_numpunct_open0_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_numpunct>(),
        8usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_numpunct)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_numpunct>(),
        4usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_numpunct)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_numpunct_byname_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_numpunct_byname>(),
        12usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_numpunct_byname)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_numpunct_byname>(),
        4usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_numpunct_byname)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_numpunct_byname_open0_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_numpunct_byname>(),
        12usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_numpunct_byname)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_numpunct_byname>(),
        4usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_numpunct_byname)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_basic_ios<_CharT> {
    pub _base: stlp_std_ios_base,
    pub _M_cached_ctype: *const stlp_std_ctype,
    pub _M_fill: stlp_std_basic_ios_char_type<_CharT>,
    pub _M_streambuf: *mut stlp_std_basic_streambuf<_CharT>,
    pub _M_tied_ostream: *mut stlp_std_basic_ostream<_CharT>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
pub type stlp_std_basic_ios_char_type<_CharT> = _CharT;
pub type stlp_std_basic_ios_int_type = [u8; 0usize];
pub type stlp_std_basic_ios_pos_type = [u8; 0usize];
pub type stlp_std_basic_ios_off_type = [u8; 0usize];
pub type stlp_std_basic_ios_traits_type<_Traits> = _Traits;
#[repr(C)]
pub struct stlp_std_basic_streambuf__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_basic_streambuf<_CharT> {
    pub vtable_: *const stlp_std_basic_streambuf__bindgen_vtable,
    pub _M_gbegin: *mut stlp_std_basic_streambuf_char_type<_CharT>,
    pub _M_gnext: *mut stlp_std_basic_streambuf_char_type<_CharT>,
    pub _M_gend: *mut stlp_std_basic_streambuf_char_type<_CharT>,
    pub _M_pbegin: *mut stlp_std_basic_streambuf_char_type<_CharT>,
    pub _M_pnext: *mut stlp_std_basic_streambuf_char_type<_CharT>,
    pub _M_pend: *mut stlp_std_basic_streambuf_char_type<_CharT>,
    pub _M_locale: stlp_std_locale,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
pub type stlp_std_basic_streambuf_char_type<_CharT> = _CharT;
pub type stlp_std_basic_streambuf_int_type = [u8; 0usize];
pub type stlp_std_basic_streambuf_pos_type = [u8; 0usize];
pub type stlp_std_basic_streambuf_off_type = [u8; 0usize];
pub type stlp_std_basic_streambuf_traits_type<_Traits> = _Traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_ostreambuf_iterator<_CharT> {
    pub _M_buf: *mut stlp_std_ostreambuf_iterator_streambuf_type<_CharT>,
    pub _M_ok: bool,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
pub type stlp_std_ostreambuf_iterator_char_type<_CharT> = _CharT;
pub type stlp_std_ostreambuf_iterator_traits_type<_Traits> = _Traits;
pub type stlp_std_ostreambuf_iterator_int_type = [u8; 0usize];
pub type stlp_std_ostreambuf_iterator_streambuf_type<_CharT> = stlp_std_basic_streambuf<_CharT>;
pub type stlp_std_ostreambuf_iterator_ostream_type<_CharT> = stlp_std_basic_ostream<_CharT>;
pub type stlp_std_ostreambuf_iterator_iterator_category = stlp_std_output_iterator_tag;
pub type stlp_std_ostreambuf_iterator_value_type = ::std::os::raw::c_void;
pub type stlp_std_ostreambuf_iterator_difference_type = ::std::os::raw::c_void;
pub type stlp_std_ostreambuf_iterator_pointer = ::std::os::raw::c_void;
pub type stlp_std_ostreambuf_iterator_reference = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_basic_ostream<_CharT> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
pub type stlp_std_basic_ostream__Self<_CharT> = stlp_std_basic_ostream<_CharT>;
pub type stlp_std_basic_ostream_char_type<_CharT> = _CharT;
pub type stlp_std_basic_ostream_int_type = [u8; 0usize];
pub type stlp_std_basic_ostream_pos_type = [u8; 0usize];
pub type stlp_std_basic_ostream_off_type = [u8; 0usize];
pub type stlp_std_basic_ostream_traits_type<_Traits> = _Traits;
pub type stlp_std_basic_ostream__Basic_ios<_CharT> = stlp_std_basic_ios<_CharT>;
pub type stlp_std_basic_ostream___ios_fn<_CharT> = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut stlp_std_basic_ios<_CharT>) -> *mut stlp_std_basic_ios<_CharT>,
>;
pub type stlp_std_basic_ostream___ios_base_fn = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut stlp_std_ios_base) -> *mut stlp_std_ios_base,
>;
pub type stlp_std_basic_ostream___ostream_fn<_CharT> = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut stlp_std_basic_ostream__Self<_CharT>,
    ) -> *mut stlp_std_basic_ostream__Self<_CharT>,
>;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_basic_ostream_sentry<_CharT> {
    pub _M_str: *mut stlp_std_basic_ostream<_CharT>,
    pub _M_ok: bool,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
pub type stlp_std_basic_ostream_sentry__Self<_CharT> = stlp_std_basic_ostream_sentry<_CharT>;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_num_put {
    pub _base: stlp_std_locale_facet,
}
pub type stlp_std_num_put_char_type<_CharT> = _CharT;
pub type stlp_std_num_put_iter_type<_OutputIter> = _OutputIter;
pub const stlp_std_float_round_style_round_indeterminate: stlp_std_float_round_style = -1;
pub const stlp_std_float_round_style_round_toward_zero: stlp_std_float_round_style = 0;
pub const stlp_std_float_round_style_round_to_nearest: stlp_std_float_round_style = 1;
pub const stlp_std_float_round_style_round_toward_infinity: stlp_std_float_round_style = 2;
pub const stlp_std_float_round_style_round_toward_neg_infinity: stlp_std_float_round_style = 3;
pub type stlp_std_float_round_style = i32;
pub const stlp_std_float_denorm_style_denorm_indeterminate: stlp_std_float_denorm_style = -1;
pub const stlp_std_float_denorm_style_denorm_absent: stlp_std_float_denorm_style = 0;
pub const stlp_std_float_denorm_style_denorm_present: stlp_std_float_denorm_style = 1;
pub type stlp_std_float_denorm_style = i32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_numeric_limits {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_stlp_std_numeric_limits_open0_bool__close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_numeric_limits_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_numeric_limits_open0_signed_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_numeric_limits_open0_unsigned_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_numeric_limits_open0_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_numeric_limits_open0_short_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_numeric_limits_open0_unsigned_short_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_numeric_limits_open0_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_numeric_limits_open0_unsigned_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_numeric_limits_open0_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_numeric_limits_open0_unsigned_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_numeric_limits_open0_float_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_numeric_limits_open0_double_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_numeric_limits_open0_long_double_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_numeric_limits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_numeric_limits)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}id"]
    pub static mut stlp_std_id: stlp_std_locale_id;
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std__SPutBackC<_CharT> {
    pub __pfrom: *mut stlp_std__SPutBackC__StreamBuf<_CharT>,
    pub __c: stlp_std__SPutBackC_int_type<_CharT>,
    pub __do_guard: bool,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
pub type stlp_std__SPutBackC__StreamBuf<_CharT> = stlp_std_basic_streambuf<_CharT>;
pub type stlp_std__SPutBackC_int_type<_CharT> = stlp_std__SPutBackC__StreamBuf<_CharT>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std_istreambuf_iterator<_CharT> {
    pub _M_buf: *mut stlp_std_istreambuf_iterator_streambuf_type<_CharT>,
    pub _M_c: _CharT,
    pub _M_eof: bool,
    pub _M_have_c: bool,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
pub type stlp_std_istreambuf_iterator_char_type<_CharT> = _CharT;
pub type stlp_std_istreambuf_iterator_traits_type<_Traits> = _Traits;
pub type stlp_std_istreambuf_iterator_int_type = [u8; 0usize];
pub type stlp_std_istreambuf_iterator_streambuf_type<_CharT> = stlp_std_basic_streambuf<_CharT>;
pub type stlp_std_istreambuf_iterator_istream_type<_CharT> = stlp_std_basic_istream<_CharT>;
pub type stlp_std_istreambuf_iterator_iterator_category = stlp_std_input_iterator_tag;
pub type stlp_std_istreambuf_iterator_value_type<_CharT> = _CharT;
pub type stlp_std_istreambuf_iterator_difference_type = [u8; 0usize];
pub type stlp_std_istreambuf_iterator_pointer<_CharT> = *const _CharT;
pub type stlp_std_istreambuf_iterator_reference<_CharT> = *const _CharT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stlp_std__No_Skip_WS {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_stlp_std__No_Skip_WS() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std__No_Skip_WS>(),
        1usize,
        concat!("Size of: ", stringify!(stlp_std__No_Skip_WS))
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std__No_Skip_WS>(),
        1usize,
        concat!("Alignment of ", stringify!(stlp_std__No_Skip_WS))
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_basic_istream<_CharT> {
    pub _M_gcount: stlp_std_streamsize,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
pub type stlp_std_basic_istream__Self<_CharT> = stlp_std_basic_istream<_CharT>;
pub type stlp_std_basic_istream_char_type<_CharT> = _CharT;
pub type stlp_std_basic_istream_int_type = [u8; 0usize];
pub type stlp_std_basic_istream_pos_type = [u8; 0usize];
pub type stlp_std_basic_istream_off_type = [u8; 0usize];
pub type stlp_std_basic_istream_traits_type<_Traits> = _Traits;
pub type stlp_std_basic_istream__Basic_ios<_CharT> = stlp_std_basic_ios<_CharT>;
pub type stlp_std_basic_istream___ios_fn<_CharT> = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut stlp_std_basic_ios<_CharT>) -> *mut stlp_std_basic_ios<_CharT>,
>;
pub type stlp_std_basic_istream___ios_base_fn = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut stlp_std_ios_base) -> *mut stlp_std_ios_base,
>;
pub type stlp_std_basic_istream___istream_fn<_CharT> = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut stlp_std_basic_istream__Self<_CharT>,
    ) -> *mut stlp_std_basic_istream__Self<_CharT>,
>;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_basic_istream_sentry {
    pub _M_ok: bool,
}
pub type stlp_std_basic_istream_sentry__Self = stlp_std_basic_istream_sentry;
pub type stlp_std_basic_istream_sentry_traits_type<_Traits> = _Traits;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_basic_iostream<_CharT> {
    pub _base: stlp_std_basic_istream<_CharT>,
    pub _base_1: stlp_std_basic_ostream<_CharT>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
}
pub type stlp_std_basic_iostream__Basic_ios<_CharT> = stlp_std_basic_ios<_CharT>;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_num_get {
    pub _base: stlp_std_locale_facet,
}
pub type stlp_std_num_get_char_type<_CharT> = _CharT;
pub type stlp_std_num_get_iter_type<_InputIter> = _InputIter;
pub type stlp_std_num_get_string_type = stlp_std_string;
pub type stlp_std_num_get__Ctype = stlp_std_ctype;
pub type stlp_std_num_get__Numpunct = stlp_std_numpunct;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_vector<_Tp, _Alloc> {
    pub _base: stlp_std_priv___Vector_base<_Tp, _Alloc>,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Alloc>>,
}
pub type stlp_std_vector__Base<_Tp, _Alloc> = stlp_std_priv___Vector_base<_Tp, _Alloc>;
pub type stlp_std_vector__Self<_Tp, _Alloc> = stlp_std_vector<_Tp, _Alloc>;
pub type stlp_std_vector_allocator_type<_Tp, _Alloc> = stlp_std_vector__Base<_Tp, _Alloc>;
pub type stlp_std_vector_value_type<_Tp> = _Tp;
pub type stlp_std_vector_pointer<_Tp> = *mut stlp_std_vector_value_type<_Tp>;
pub type stlp_std_vector_const_pointer<_Tp> = *const stlp_std_vector_value_type<_Tp>;
pub type stlp_std_vector_iterator<_Tp> = *mut stlp_std_vector_value_type<_Tp>;
pub type stlp_std_vector_const_iterator<_Tp> = *const stlp_std_vector_value_type<_Tp>;
pub type stlp_std_vector_reference<_Tp> = *mut stlp_std_vector_value_type<_Tp>;
pub type stlp_std_vector_const_reference<_Tp> = *const stlp_std_vector_value_type<_Tp>;
pub type stlp_std_vector_size_type = usize;
pub type stlp_std_vector_difference_type = isize;
pub type stlp_std_vector__Iterator_category = stlp_std_random_access_iterator_tag;
pub type stlp_std_vector_const_reverse_iterator<_Tp> =
    stlp_std_reverse_iterator<stlp_std_vector_const_iterator<_Tp>>;
pub type stlp_std_vector_reverse_iterator<_Tp> =
    stlp_std_reverse_iterator<stlp_std_vector_iterator<_Tp>>;
#[test]
fn __bindgen_test_layout_stlp_std___type_traits_open0_stlp_std_priv__Bit_reference_close0_instantiation(
) {
    assert_eq!(
        ::std::mem::size_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std___type_traits>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std___type_traits)
        )
    );
}
pub type stlp_std_bit_vector = stlp_std_vector<bool, stlp_std_allocator>;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_set {
    pub _M_t: stlp_std_set__Rep_type,
}
pub type stlp_std_set__Self = stlp_std_set;
pub type stlp_std_set_key_type<_Key> = _Key;
pub type stlp_std_set_value_type<_Key> = _Key;
pub type stlp_std_set_key_compare<_Compare> = _Compare;
pub type stlp_std_set_value_compare<_Compare> = _Compare;
pub type stlp_std_set__SetTraits = stlp_std_priv___SetTraitsT;
pub type stlp_std_set__Rep_type = stlp_std_priv___Rb_tree<_Compare>;
pub type stlp_std_set_pointer = stlp_std_set__Rep_type;
pub type stlp_std_set_const_pointer = stlp_std_set__Rep_type;
pub type stlp_std_set_reference = stlp_std_set__Rep_type;
pub type stlp_std_set_const_reference = stlp_std_set__Rep_type;
pub type stlp_std_set_iterator = stlp_std_set__Rep_type;
pub type stlp_std_set_const_iterator = stlp_std_set__Rep_type;
pub type stlp_std_set_reverse_iterator = stlp_std_set__Rep_type;
pub type stlp_std_set_const_reverse_iterator = stlp_std_set__Rep_type;
pub type stlp_std_set_size_type = stlp_std_set__Rep_type;
pub type stlp_std_set_difference_type = stlp_std_set__Rep_type;
pub type stlp_std_set_allocator_type = stlp_std_set__Rep_type;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_multiset {
    pub _M_t: stlp_std_multiset__Rep_type,
}
pub type stlp_std_multiset__Self = stlp_std_multiset;
pub type stlp_std_multiset_key_type<_Key> = _Key;
pub type stlp_std_multiset_value_type<_Key> = _Key;
pub type stlp_std_multiset_key_compare<_Compare> = _Compare;
pub type stlp_std_multiset_value_compare<_Compare> = _Compare;
pub type stlp_std_multiset__MultisetTraits = stlp_std_priv___MultisetTraitsT;
pub type stlp_std_multiset__Rep_type = stlp_std_priv___Rb_tree<_Compare>;
pub type stlp_std_multiset_pointer = stlp_std_multiset__Rep_type;
pub type stlp_std_multiset_const_pointer = stlp_std_multiset__Rep_type;
pub type stlp_std_multiset_reference = stlp_std_multiset__Rep_type;
pub type stlp_std_multiset_const_reference = stlp_std_multiset__Rep_type;
pub type stlp_std_multiset_iterator = stlp_std_multiset__Rep_type;
pub type stlp_std_multiset_const_iterator = stlp_std_multiset__Rep_type;
pub type stlp_std_multiset_reverse_iterator = stlp_std_multiset__Rep_type;
pub type stlp_std_multiset_const_reverse_iterator = stlp_std_multiset__Rep_type;
pub type stlp_std_multiset_size_type = stlp_std_multiset__Rep_type;
pub type stlp_std_multiset_difference_type = stlp_std_multiset__Rep_type;
pub type stlp_std_multiset_allocator_type = stlp_std_multiset__Rep_type;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_map {
    pub _M_t: stlp_std_map__Rep_type,
}
pub type stlp_std_map__Self = stlp_std_map;
pub type stlp_std_map_key_type<_Key> = _Key;
pub type stlp_std_map_data_type<_Tp> = _Tp;
pub type stlp_std_map_mapped_type<_Tp> = _Tp;
pub type stlp_std_map_value_type<_Key, _Tp> = stlp_std_pair<_Key, _Tp>;
pub type stlp_std_map_key_compare<_Compare> = _Compare;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_map_value_compare<_Compare> {
    pub comp: _Compare,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Compare>>,
}
pub type stlp_std_map__MapTraits = stlp_std_priv___MapTraitsT;
pub type stlp_std_map__Rep_type = stlp_std_priv___Rb_tree<_Compare>;
pub type stlp_std_map_pointer = stlp_std_map__Rep_type;
pub type stlp_std_map_const_pointer = stlp_std_map__Rep_type;
pub type stlp_std_map_reference = stlp_std_map__Rep_type;
pub type stlp_std_map_const_reference = stlp_std_map__Rep_type;
pub type stlp_std_map_iterator = stlp_std_map__Rep_type;
pub type stlp_std_map_const_iterator = stlp_std_map__Rep_type;
pub type stlp_std_map_reverse_iterator = stlp_std_map__Rep_type;
pub type stlp_std_map_const_reverse_iterator = stlp_std_map__Rep_type;
pub type stlp_std_map_size_type = stlp_std_map__Rep_type;
pub type stlp_std_map_difference_type = stlp_std_map__Rep_type;
pub type stlp_std_map_allocator_type = stlp_std_map__Rep_type;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_multimap {
    pub _M_t: stlp_std_multimap__Rep_type,
}
pub type stlp_std_multimap__Self = stlp_std_multimap;
pub type stlp_std_multimap_key_type<_Key> = _Key;
pub type stlp_std_multimap_data_type<_Tp> = _Tp;
pub type stlp_std_multimap_mapped_type<_Tp> = _Tp;
pub type stlp_std_multimap_value_type<_Key, _Tp> = stlp_std_pair<_Key, _Tp>;
pub type stlp_std_multimap_key_compare<_Compare> = _Compare;
#[repr(C)]
#[derive(Debug)]
pub struct stlp_std_multimap_value_compare<_Compare> {
    pub comp: _Compare,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Compare>>,
}
pub type stlp_std_multimap__MultimapTraits = stlp_std_priv___MultimapTraitsT;
pub type stlp_std_multimap__Rep_type = stlp_std_priv___Rb_tree<_Compare>;
pub type stlp_std_multimap_pointer = stlp_std_multimap__Rep_type;
pub type stlp_std_multimap_const_pointer = stlp_std_multimap__Rep_type;
pub type stlp_std_multimap_reference = stlp_std_multimap__Rep_type;
pub type stlp_std_multimap_const_reference = stlp_std_multimap__Rep_type;
pub type stlp_std_multimap_iterator = stlp_std_multimap__Rep_type;
pub type stlp_std_multimap_const_iterator = stlp_std_multimap__Rep_type;
pub type stlp_std_multimap_reverse_iterator = stlp_std_multimap__Rep_type;
pub type stlp_std_multimap_const_reverse_iterator = stlp_std_multimap__Rep_type;
pub type stlp_std_multimap_size_type = stlp_std_multimap__Rep_type;
pub type stlp_std_multimap_difference_type = stlp_std_multimap__Rep_type;
pub type stlp_std_multimap_allocator_type = stlp_std_multimap__Rep_type;
#[test]
fn __bindgen_test_layout_stlp_std_ctype_open0_char_close0_instantiation_1() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_ctype>(),
        16usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_ctype)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_ctype>(),
        4usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_ctype)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_ctype_byname_open0_char_close0_instantiation_1() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_ctype_byname>(),
        1044usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_ctype_byname)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_ctype_byname>(),
        4usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_ctype_byname)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_ctype_open0_wchar_t_close0_instantiation_1() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_ctype>(),
        8usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_ctype)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_ctype>(),
        4usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_ctype)
        )
    );
}
#[test]
fn __bindgen_test_layout_stlp_std_ctype_byname_open0_wchar_t_close0_instantiation_1() {
    assert_eq!(
        ::std::mem::size_of::<stlp_std_ctype_byname>(),
        12usize,
        concat!(
            "Size of template specialization: ",
            stringify!(stlp_std_ctype_byname)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<stlp_std_ctype_byname>(),
        4usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(stlp_std_ctype_byname)
        )
    );
}
pub type __gnu_cxx___conditional_type___type<_Iftrue> = _Iftrue;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___add_unsigned {
    pub _address: u8,
}
pub type __gnu_cxx___add_unsigned___if_type = u8;
pub type __gnu_cxx___add_unsigned___type = __gnu_cxx___add_unsigned___if_type;
#[test]
fn __bindgen_test_layout___gnu_cxx___add_unsigned_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___add_unsigned_open0_signed_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___add_unsigned_open0_short_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___add_unsigned_open0_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___add_unsigned_open0_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___add_unsigned_open0_long_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___remove_unsigned {
    pub _address: u8,
}
pub type __gnu_cxx___remove_unsigned___if_type = u8;
pub type __gnu_cxx___remove_unsigned___type = __gnu_cxx___remove_unsigned___if_type;
#[test]
fn __bindgen_test_layout___gnu_cxx___remove_unsigned_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___remove_unsigned_open0_unsigned_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___remove_unsigned_open0_unsigned_short_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___remove_unsigned_open0_unsigned_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___remove_unsigned_open0_unsigned_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___remove_unsigned_open0_unsigned_long_long_close0_instantiation()
{
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
}
pub type __gnu_cxx___promote___type = f64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___promote_2 {
    pub _address: u8,
}
pub type __gnu_cxx___promote_2___type<_Tp2> = _Tp2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___promote_3 {
    pub _address: u8,
}
pub type __gnu_cxx___promote_3___type<_Tp2> = _Tp2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___promote_4 {
    pub _address: u8,
}
pub type __gnu_cxx___promote_4___type<_Tp2> = _Tp2;
extern "C" {
    #[link_name = "\u{1}_ZN9__gnu_cxx27__verbose_terminate_handlerEv"]
    pub fn __gnu_cxx___verbose_terminate_handler();
}
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = f64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    assert_eq!(
        ::std::mem::size_of::<div_t>(),
        8usize,
        concat!("Size of: ", stringify!(div_t))
    );
    assert_eq!(
        ::std::mem::align_of::<div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(div_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<div_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<div_t>())).rem as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    assert_eq!(
        ::std::mem::size_of::<ldiv_t>(),
        8usize,
        concat!("Size of: ", stringify!(ldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ldiv_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ldiv_t>())).rem as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    assert_eq!(
        ::std::mem::size_of::<lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<lldiv_t>(),
        4usize,
        concat!("Alignment of ", stringify!(lldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtod(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn strtof(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
extern "C" {
    pub fn strtold(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn strtof32(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> _Float32;
}
extern "C" {
    pub fn strtof64(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> _Float64;
}
extern "C" {
    pub fn strtof32x(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> _Float32x;
}
extern "C" {
    pub fn strtof64x(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> _Float64x;
}
extern "C" {
    pub fn strtol(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoul(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtouq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtoll(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strfromd(
        __dest: *mut ::std::os::raw::c_char,
        __size: usize,
        __format: *const ::std::os::raw::c_char,
        __f: f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strfromf(
        __dest: *mut ::std::os::raw::c_char,
        __size: usize,
        __format: *const ::std::os::raw::c_char,
        __f: f32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strfroml(
        __dest: *mut ::std::os::raw::c_char,
        __size: usize,
        __format: *const ::std::os::raw::c_char,
        __f: f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strfromf32(
        __dest: *mut ::std::os::raw::c_char,
        __size: usize,
        __format: *const ::std::os::raw::c_char,
        __f: _Float32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strfromf64(
        __dest: *mut ::std::os::raw::c_char,
        __size: usize,
        __format: *const ::std::os::raw::c_char,
        __f: _Float64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strfromf32x(
        __dest: *mut ::std::os::raw::c_char,
        __size: usize,
        __format: *const ::std::os::raw::c_char,
        __f: _Float32x,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strfromf64x(
        __dest: *mut ::std::os::raw::c_char,
        __size: usize,
        __format: *const ::std::os::raw::c_char,
        __f: _Float64x,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    assert_eq!(
        ::std::mem::size_of::<__locale_struct>(),
        116usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<__locale_struct>(),
        4usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__locales as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_b as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_tolower as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_toupper as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__names as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names)
        )
    );
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn strtol_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
        __loc: locale_t,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoul_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
        __loc: locale_t,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoll_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
        __loc: locale_t,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
        __loc: locale_t,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtod_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> f64;
}
extern "C" {
    pub fn strtof_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> f32;
}
extern "C" {
    pub fn strtold_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> f64;
}
extern "C" {
    pub fn strtof32_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> _Float32;
}
extern "C" {
    pub fn strtof64_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> _Float64;
}
extern "C" {
    pub fn strtof32x_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> _Float32x;
}
extern "C" {
    pub fn strtof64x_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> _Float64x;
}
extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type ino64_t = __ino64_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type off64_t = __off64_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type useconds_t = __useconds_t;
pub type suseconds_t = __suseconds_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulonglong;
pub type register_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 32usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sigset_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        8usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        4usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_usec as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        8usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        4usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_nsec as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub fds_bits: [__fd_mask; 32usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        4usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fd_set>())).fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
pub type blkcnt64_t = __blkcnt64_t;
pub type fsblkcnt64_t = __fsblkcnt64_t;
pub type fsfilcnt64_t = __fsfilcnt64_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __flags: ::std::os::raw::c_uchar,
    pub __shared: ::std::os::raw::c_uchar,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad2: ::std::os::raw::c_uchar,
    pub __cur_writer: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_rwlock_arch_t>(),
        32usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_rwlock_arch_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__readers as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__wrphase_futex as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers_futex as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad3 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad4 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__flags as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__shared as *const _ as usize
        },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__rwelision as *const _ as usize
        },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad2 as *const _ as usize },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__cur_writer as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[test]
fn bindgen_test_layout___pthread_internal_slist() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_slist>(),
        4usize,
        concat!("Size of: ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_slist>(),
        4usize,
        concat!("Alignment of ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_slist>())).__next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_slist),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __kind: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __bindgen_anon_1: __pthread_mutex_s__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_mutex_s__bindgen_ty_1 {
    pub __elision_data: __pthread_mutex_s__bindgen_ty_1__bindgen_ty_1,
    pub __list: __pthread_slist_t,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s__bindgen_ty_1__bindgen_ty_1 {
    pub __espins: ::std::os::raw::c_short,
    pub __eelision: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_mutex_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s__bindgen_ty_1__bindgen_ty_1>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_mutex_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_mutex_s__bindgen_ty_1__bindgen_ty_1>())).__espins
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__espins)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_mutex_s__bindgen_ty_1__bindgen_ty_1>())).__eelision
                as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__eelision)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_mutex_s__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_mutex_s__bindgen_ty_1>())).__elision_data as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s__bindgen_ty_1),
            "::",
            stringify!(__elision_data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_mutex_s__bindgen_ty_1>())).__list as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s__bindgen_ty_1),
            "::",
            stringify!(__list)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        24usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        4usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__lock as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__owner as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__kind as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__nusers as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __bindgen_anon_1: __pthread_cond_s__bindgen_ty_1,
    pub __bindgen_anon_2: __pthread_cond_s__bindgen_ty_2,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_1 {
    pub __wseq: ::std::os::raw::c_ulonglong,
    pub __wseq32: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1,
    _bindgen_union_align: [u32; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq32 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq32)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_2 {
    pub __g1_start: ::std::os::raw::c_ulonglong,
    pub __g1_start32: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1,
    _bindgen_union_align: [u32; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2>(),
        4usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start32 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start32)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        4usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_refs as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g1_orig_size as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__wrefs as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_signals as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 36usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u32; 9usize],
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        36usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 24usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u32; 6usize],
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        24usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
    _bindgen_union_align: [u32; 12usize],
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u32; 8usize],
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 20usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u32; 5usize],
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        20usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn initstate(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    assert_eq!(
        ::std::mem::size_of::<random_data>(),
        28usize,
        concat!("Size of: ", stringify!(random_data))
    );
    assert_eq!(
        ::std::mem::align_of::<random_data>(),
        4usize,
        concat!("Alignment of ", stringify!(random_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).fptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(fptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rptr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rand_type as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rand_deg as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_deg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rand_sep as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_sep)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).end_ptr as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(end_ptr)
        )
    );
}
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srandom_r(
        __seed: ::std::os::raw::c_uint,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn initstate_r(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_drand48_data() {
    assert_eq!(
        ::std::mem::size_of::<drand48_data>(),
        24usize,
        concat!("Size of: ", stringify!(drand48_data))
    );
    assert_eq!(
        ::std::mem::align_of::<drand48_data>(),
        4usize,
        concat!("Alignment of ", stringify!(drand48_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__old_x as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__old_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__c as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__init as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__init)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__a as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__a)
        )
    );
}
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand48_r(
        __seedval: ::std::os::raw::c_long,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn seed48_r(
        __seed16v: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lcong48_r(
        __param: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn malloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn calloc(__nmemb: usize, __size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn reallocarray(
        __ptr: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn alloca(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn valloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: usize,
        __size: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aligned_alloc(__alignment: usize, __size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn abort();
}
extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn at_quick_exit(
        __func: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn on_exit(
        __func: ::std::option::Option<
            unsafe extern "C" fn(
                __status: ::std::os::raw::c_int,
                __arg: *mut ::std::os::raw::c_void,
            ),
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn secure_getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __replace: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemp64(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps64(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkostemp(
        __template: *mut ::std::os::raw::c_char,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkostemp64(
        __template: *mut ::std::os::raw::c_char,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkostemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkostemps64(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn canonicalize_file_name(
        __name: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn realpath(
        __name: *const ::std::os::raw::c_char,
        __resolved: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type comparison_fn_t = __compar_fn_t;
pub type __compar_d_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    );
}
extern "C" {
    pub fn qsort_r(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_d_fn_t,
        __arg: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long, __denom: ::std::os::raw::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(
        __numer: ::std::os::raw::c_longlong,
        __denom: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qfcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qgcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
